{"business_id":"Jdqg97lLo_qJlCqU9RjIEA","cool":1,"date":"2012-09-08","funny":1,"review_id":"Bz5kR052DviDGQGV_q8VUQ","stars":3,"text":"Dipped cone all the way! This location is tricky because it gets very busy in the evenings. Best route, don't go in the drive-thru, park your car and order inside. It's quicker and easier!","useful":1,"user_id":"j5yfS1QjGwNLQ0h4_wDyxg"}
{"business_id":"Jdqg97lLo_qJlCqU9RjIEA","cool":1,"date":"2016-09-17","funny":1,"review_id":"Sc2eLc1kTsehqraMhrT1zg","stars":5,"text":"Always amazing food and service. Love their chicken Parm sandwich. Their blizzards are awesome too.","useful":0,"user_id":"dk8-B6hKb1XOmYJKC4Ig3Q"}
{"business_id":"Jdqg97lLo_qJlCqU9RjIEA","cool":0,"date":"2016-07-21","funny":0,"review_id":"Qpz73uZ60Gk7MSKbD6Y6_A","stars":1,"text":"This place is literally the worst. Hopefully the got rid of the awful management, because the owner is actually sort of nice. I ordered ice cream and just got a sloppy mess and no apology.","useful":0,"user_id":"9RG87QSBaTmcbDu3ydQJ2g"}
{"business_id":"Jdqg97lLo_qJlCqU9RjIEA","cool":0,"date":"2017-01-28","funny":1,"review_id":"NdjK8rttbevfoDwgXcL-eg","stars":3,"text":"Very nice and new. Staff is always friendly but the drive thru is ridiculous. Two burgers and a diet soda and Im still sitting here 10 minutes after the fact? People have stuff to do. I could cook a meal at home in this time.","useful":0,"user_id":"y6IogOYLjAs8Mksx62vnDQ"}
{"business_id":"Jdqg97lLo_qJlCqU9RjIEA","cool":0,"date":"2014-01-17","funny":0,"review_id":"2PoRWtHb6ulqr8AJv_QGhA","stars":3,"text":"Nothing special about this place, their ice cream is ok. On busy nights drive thru is insane and impossible to turn left out of here. Prices are high too. The employees are really nice and it is a clean store.","useful":0,"user_id":"VKwI11qTXOxHmlh2yr_2TQ"}
{"business_id":"Jdqg97lLo_qJlCqU9RjIEA","cool":0,"date":"2014-02-27","funny":0,"review_id":"WlqmIvizN8A_oKNR-MPuPw","stars":4,"text":"I love this location! The staff is very friendly and helpful. Also, you just can't beat the $5 meal special.","useful":0,"user_id":"sxb4v27_35Lp1yktej7ZEQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2013-11-19","funny":0,"review_id":"FsS5TUFPI8QJEE60-HR3dw","stars":2,"text":"Wished it was better..\nAfter watching man vs. food I decided to stop by, décor was not that homey and welcoming, and the neighborhood was bad, but nothing I haven't been around before.  The ribs were very fatty and grisly, it was disappointing and I didn't get enough sauce and when I asked for a little more they wanted to charge me, the coleslaw was awesome!  I noticed a hair in my food and it turned me off to the rest of it, so i threw it away , I wont be returning...\nsorry guys","useful":1,"user_id":"bWh4k_cCuVt5GLVd33xIxg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-12-18","funny":0,"review_id":"7xGHiLP1vAaGmX6srC_XXw","stars":4,"text":"Decor and service leave much to be desired, but the food is worthy of 4.5 stars.\nI've eaten at both locations several times now over the past year, since moving from San Diego, and I think the food is very good.  The fried chicken and Polish Boy in particular are awesome.  The ribs are just average. good sauce, but not super tender and have not been smoked enough for my taste.","useful":0,"user_id":"nQ4e81UdfczimYcIUtO3HA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-09-12","funny":0,"review_id":"ZWlXWc9LHPLiOksrp-enyw","stars":5,"text":"My husband and I ate here tonight for the first time and it will NOT be our last! The fried chicken is best I've ever had  and my ppl are from South Carolina! His sauce is very very good! And the owner was very hospitable and spoke to us about the  history of this famous restaurant. They will be taping on Rachel Ray's show next week! Kudos y'all!","useful":0,"user_id":"gJPa95ZRozMhiOqvENpspA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2012-02-28","funny":1,"review_id":"KpRwKYyQ93ypyDSdA7IXfw","stars":2,"text":"Don't believe the hype. Nooooo! \n\nIn the Cleveland area, there's an endless supply of small, unique eateries that take the time to create and serve unique, tasteful, hand-crafted items with flavor. Hot Sauce Williams has created a great commodity in his BBQ sauce, however, ruins the spirit of Cleveland goodies by serving it over generic, tasteless, frozen bag items. \n\nGranted, my review is based off a Polish Boy sandwich combo. I haven't tried anything else and after trying the combo, I most likely won't make my way back to try anything else. \n\nG Love sang about it, so it can't be that bad, can it? Can the creator of such gems as 'Cold Beverages' and 'Milk and Cereal' really steer me in the wrong direction? He did, however, I'll forgive him with a listening of 'Baby's Got Sauce' (pun intended?). \n\nThe fries are actually store-bought Ore-Ida brand fries. I can remember being served those with dinner when I was a lad in the late 1980s. They are perfectly tasteless. The sauce drenches over them, adding taste, but it just seems incredibly lazy to take something I can easily buy in the store, increase the price, and serve it to customers.  \n\nThe buns are of exactly the same nature - walk in to any grocery store and purchase the cheapest hot dog buns they have - you'd be getting exactly what is served. \n\nThe sausage wasn't bad, had some taste and was of average size (I'd throw in a 'that's what she said,' but that phrase is so overused, I'll let it be). \n\nIt isn't terrible, but to be honest, without the sauce, there's no way Hot Sauce Williams would still be in business after all these years. The cute nickname helps, I'm guessing. I'm guessing a lot of people wouldn't keep returning to a \"Mr. Williams Barbecue Restaurant\" - so I guess the gimmick is working. Plus, it'd be totally cool of Williams decided to sponsor a MMA fighter, just so there'd be a fighter with the 'Hot Sauce' nickname. \n\nThe service is, well, non-existent. I asked for 'slaw on the side, and when I received my meal, my 'slaw was in the middle, which made the bun and accompanying fries soggy on the center and sides - they fell apart upon contact. The 'slaw is mostly liquid. I was reduced to eating a weird liquid mixture of Ore-Ida fries, juicy 'slaw, BBQ sauce and bread. \n\nSort of weird, they also give out cans of soda instead of fountain drinks. \n\nI'd buy a bottle of the sauce and use that at home, but I really wouldn't suggest eating here unless you're interested in a bland, sloppy mess of stuff you can grab at the nearest Piggly Wiggly (which, for Northerners, is probably pretty far away, so I'd have no clue why you'd travel that far to grab those simple ingredients).","useful":5,"user_id":"bAwfPH4lXNzgcYp9JFy6ow"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":3,"date":"2014-10-06","funny":6,"review_id":"OZvrgp4vWBsYqIt3-YMSEw","stars":3,"text":"Don't believe the hype!\n\nAfter seeing this location on Man vs Food I had to check it out for myself. I have given this location two back to back chances and it was a disappointment on both occasions. \n\nThe place is defiantly a dive and not the cleanest. One our first visit on a Saturday night we ordered two 4 piece chicken dinners for my wife and I and one 2 piece chicken dinner for our daughter. We finally received our food after a 45 minute wait and the place was completely dead! The four piece chicken dinner comes with a breast, wing, thigh and drumstick, coleslaw, fries and BBQ sauce on the chicken & fries. Talk about a party in my mouth! The chicken was hot and juicy and cooked just right and seasoned to perfection! The fries and slaw were good also.\n\nThe employee's attitudes and customer service skills are in need of as much of a makeover as the dining space needs. The second time we went was the next day as we were on our way back home from Cleveland and got a 20 piece chicken to go. The girl at the cash register was on her phone the whole time I placed the order. I understand that it's a slow Sunday afternoon but, really?! She had a really foul attitude and just couldn't be bothered with taking orders. She was acting like actually pausing her phone conversation to take my order was a major inconvenience to her. \n\nIt took about 25 minutes to get our chicken the second time which is weird as I ordered a lot more chicken the second time. I would defiantly call ahead to place your order because if you wait on your food it WILL be a while.\n\nThe chicken is very good but, not worth the wait and dealing with the employee's bad attitudes. I'd much rather go to Zanzibar for their delicious honey fried chicken. Hell, I'll eeven take Church's Chicken instead!","useful":10,"user_id":"BjtJ3VkMOxV2Lan037AFuw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-10-07","funny":0,"review_id":"LDln5I1QXIIinI74RmjuSQ","stars":1,"text":"Sauce spicy and blan absolutely no flavor the decor screams dont eat here plus the entire staff is moody not to mention chicken wings are 1.50 a piece a true rip off!","useful":0,"user_id":"ZfqrQVvCfnhlqma6bkEWJw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2016-06-24","funny":2,"review_id":"_Ob9cAp8dT0w1X5GsZP6vg","stars":5,"text":"Seti's truck wasn't around so we decided to head to a restaurant with polish boys that didn't have wheels. I'm really glad we did that - the combo of the polish...girl...was delicious!  It had the added pulled pork on it, the combo of flavors, perfect.  \n\nWhat the fam really loved was that sauce.  I'll probably never be in Cleveland again, but I'll dream of that sauce.  We got the fried chicken, stuck the sauce on the side...but I can see why people just have it drenching that chicken.  Glad we did get it on the side, though, since it was glorious to dip everything into it.  Almost ordered another fries just as a vehicle for the hot sauce.","useful":1,"user_id":"AiQL1INckKUk1Bx2WD8ozw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-04-14","funny":0,"review_id":"g9VGCBuaZ079NtNNfmVPaA","stars":1,"text":"The location on 79th Carnegie, is a hot ghetto mess. I am ashamed of what the establishment has turned into. Maybe I'll try out superior or Lee rd.","useful":0,"user_id":"J50BanBFNY4naDYAJRAZAA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2011-04-19","funny":1,"review_id":"3luqqY_D_XQCj_JUOaCL2w","stars":2,"text":"Let me just start by saying that this place did not live up to the Man V. Food hype. I think I have been to better buffets before.\n\nTerrible customer service earned them one out five stars. Extremely rude and inconsiderate server. Took us ten minutes to place our order when at the front of the line. She decided to have side conversations while we were still ordering.\n\nFood: I ordered the Polish Boy and Dark Meat Chicken. \n\nPolish Boy: Polish Sausage, Coleslaw, Fries, and BBQ sauce on a bun. It was drenched in sauce, making the bun soggy. It was not bad but was not all that. The sauce is not very good for BBQ. It is runny like Open Pit and has a little zing to it. Adam Richman was high when he said this sauce was incredible.\n\nChicken: Very good chicken, dark meat. The breading was very crispy and the meat was juicy. I enjoyed this part of the meal.\n\nOverall, I would not return. No place should treat their guests with such arrogance and ineptness. I think I would rather take my money to Popeye's, its most comparable match.","useful":0,"user_id":"mzexPXl2iuASVakpjODhrQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-08-31","funny":0,"review_id":"Tfkyj1e0-_D_t2uos9W5gg","stars":4,"text":"I love Hot Sauce Wiliams. Well, I love their food. Their service is very hit or miss.\n\nThough HSW is a bbq joint, I don't think it's necessarily their strongest point. The bbq sauce is really fantastic. The ribs and pulled pork are really good, but not really great. Granted, that's really comparing to at-home bbq using a smoker. When it comes to restaurants, you will be hard pressed to find better bbq in NE Ohio. And it's definitely better than other Ohio bbq chains like Carolina BBQ and City BBQ. \n\nWhere HSW really shines is their fried chicken and Po Boy and Po Girl. The fried chicken is easily some of the best fried chicken I've ever had - crisp skin, cooked to perfect doneness. But if you go to HSW, be sure to get a Po Boy or Po Girl. What's the exact difference? I don't remember. The better one is the one with a hot sausage in a bun topped with pork shoulder, french fries, coleslaw, and french fries (I think that's the po girl). I cannot eat it with my hands, because it falls apart. If you can eat it without utensils, then give yourself 100 extra Man Points (c). Unfortunately, I dont get to make it to HSW very often, so I've not been able to try their fried fish or several other foods.\n\nFor drinks, they have soda machines and HUGs (kool aid in a tiny barel). Last time I was there, they didn't have a soda machine, so no free refills, which is a bummer\n\nThough I love the food and their pink & blue color scheme outside, I think they only hire terrible people to work the registers. I've literally never eaten there and experienced a cashier that wasn't rude. They not only seemed to hate me on a personal level, but were offended by my audacity of ordering food there. With that being said, the cooks and individuals handing out the food have always been very sweet and friendly. Also, there was an employee my first visit there who helped me open a stuck bathroom door, and he was really great. I'm confused as to why the cashiers have been awful. Granted, I haven't been to HSW in well over a year since I moved out of state, so perhaps their cashiers are less butthurt now.\n\nIf I remember correctly, all locations are not places you want to be late and night by yourself with obvious fistfuls of cash (if ya catch my drift), so if you're an easily scared white person, go for lunch. Also, they used to only accept cash - not sure if that's changed.\n\nIf you're looking for a local restaurant and would like some soul food or bbq, I very highly recommend HSW. Also, the Carnegie location is right down the road from the Cleveland Clinic main campus. So, if you have an appointment with your cardiologist or nutritionist or whatever, you may as well stop by for some lunchtime fried perch and peach cobbler after your appointment.","useful":0,"user_id":"nNtI1xRXcZs5R3sBEa8xqw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-01-09","funny":0,"review_id":"sDmMfrsRQtEPYx_X4mmpCw","stars":2,"text":"The food was okay. The wings and fries were not that fresh and very little chicken came on the bone. The sauce was ok. I like Open Pit Bar B Que's (Cleveland, OH) sauce better because it's sweeter. I tried this because it was on the travel channel. It really wasn't that good. I like Harold's Chicken Shack in Atlanta and Chicago way better when it comes to chicken and sauce.","useful":1,"user_id":"GKXrTZecEsqWuACpRNyuxw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2015-06-07","funny":0,"review_id":"DR0dmQGFGQQEgn_BvG3CCw","stars":4,"text":"Best fried chicken out there. Skip the hot sauce, it isn't hot, and is frankly pretty disgusting. The various sides on offer are mediocre. There is a high likelihood of there being no food in the restaurant, especially later in the day, so call before going. Seems like it's takeout only in spite of having a large restaurant space.","useful":0,"user_id":"tNy6TYGSOEgtFxYPKM-jrw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-11-21","funny":0,"review_id":"DySF6mE1hZ2GwzPA7sVdEQ","stars":5,"text":"1st time visitor. Portions were great and the personable service really gave it that home feel. Had the Rib Tip....my oh my, shut my mouth.  What was that devine creation?  Go get you some now! Good food + nice price = great atomphsere.  Enjoyed learning their history via the cook during her lunch break. You know if Samuel Jackson and Charlie Sheen dine there it's gotta be good.","useful":0,"user_id":"2jlimdYxRiZt0-OegVqvqQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-05-04","funny":0,"review_id":"R6wkvCo8OtSQetFyhTYGsA","stars":3,"text":"Hot Sauce Williams has some pretty poor BBQ, mediocre fried chicken, and an odd sauce that they'll put on either one.  Of course then there's the polish boy. I'll explain.\n\nThis place has become a Cleveland landmark, probably more from visits of Anthony Bourdain and ManVFood than anything else.   There are a number of similar spots in Cleveland and you have to respect it for what it is.  It's not the kind of place that's trying to win competitions here.  It's more of a fast-food style cheap BBQ.\n\nOn our most recent visit we got a polish boy and some fried chicken.  A polish boy is a kielbasa, fries, coleslaw, and sauce on a bun.  It's an unrefined mess and it's pretty tasty.  In my opinion their chicken is so-so.\n\nThe service seems to be down to business.  I wouldn't describe my experiences as overly friendly.\n\nIf you're an out-of towner I suggest trying it for what it is.  The polish boy is uniquely Cleveland.  The neighborhood is characteristic for much of the east side of the city.  It may not be pretty but it is what it is.","useful":1,"user_id":"t8gR8NCD56bF1XcAjwgkEw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":2,"date":"2011-07-16","funny":0,"review_id":"g3KutFVxg68VecHvFzkANA","stars":4,"text":"Despite being slathered in their sauce, this fried chicken surprisingly maintains its crispiness and isn't the least bit overpowered by the flavors of the sauce. Actually, the sauce compliments the chicken so well that it had me asking for more- I even bought a bottle of their original sauce for the road since we were just visiting Cleveland.\nOf the two sides that were ordered, the mac n cheese tastes similar to a homemade baked dish packed with cheesy goodness. The fried okra was decent, but was coated in so much batter that I could barely taste the okra.\nIn addition to the good food, the service is also worth mentioning- everyone behind the counter was hospitable and made for a great first visit to Hot Sauce Williams","useful":0,"user_id":"hVOJJaaKRdQvB__BMq5yDA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-07-13","funny":0,"review_id":"ijrFuMmsYw8vI--DjkAQtA","stars":1,"text":"I can't remember the last time I ate here because it has been that long. Well it will be my last... The menu on Yelp quotes one price so a slab dinner 19.95 when I pick up my food it's $29. The girl at the register rude even when you call in to order  tone very dry... Food over I should have saved myself the trouble and gas and just pulled out my own grill!","useful":1,"user_id":"gSwBZSw7lem2IEB8jId4Gw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2012-10-15","funny":0,"review_id":"RD9R88hIOdkfWvsxXs3Swg","stars":5,"text":"I'm going to keep my review short and sweet! \n\nPolish Boy and the wings, OFF THE CHAIN!\n\nNuff siad!","useful":0,"user_id":"2XuP-lUVBF09qPmCpZ8oQA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2012-06-13","funny":0,"review_id":"dMyrZA_EXD9y_UqK7-Hj0Q","stars":4,"text":"Hot Sauce Williams is a Cleveland tradition! I will always stop here for the fries with sauce!","useful":0,"user_id":"NGnS6xFCefAB8JsuuNIIYw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2011-01-31","funny":1,"review_id":"C_9CV4C722vQ_Atd9_LDRQ","stars":5,"text":"hot sauce williams is amazing, but it is certainly not a place to go for a low calorie meal. fried chicken, st. louis style ribs, mac n cheese, sweet potato pie, etc. it's all awesome. the fried chicken is done perfectly! my mouth waters just thinking of this place. its a simple place, you order from a counter and can either take your food to go or eat it there. all that matters is the food is killer!","useful":1,"user_id":"igcnVpgAYC2EMP0sXZmuTQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":3,"date":"2013-02-02","funny":7,"review_id":"RYHKUSUyPeaU38RytDtZww","stars":2,"text":"I've been going to Hot Sauce Williams for the past 15 years and this place is going down hill big time!  The service continues to get worse and the attitude of the workers is piss poor.  They ignore you and can be very rude as well.  Also, the place is very dirty and I would love to see the health inspection report.  \n\nI will admit there Sauce is some of the best I have ever had.  The wings are just not as good as they used too, but the Polish Boy is still very good.  The Mac n Cheese is very overrated and DO NOT ORDER THE RIBS.  They are like chowing down on a gristled piece of fat and that has the texture of rubber.  My friend tossed them away they were so bad.  \n\nVery sad to see an Cleveland Institution goes down the tubes like this and hope they can improve but that's the last they have seen of my business.  \n\nP.S-Don't even bother going through the drive thru unless you have 20 mins to spare, no joke.","useful":10,"user_id":"kEEx6yEf81i9Wk5Ww1q6GA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":3,"date":"2009-03-06","funny":3,"review_id":"yUeBnTvqPNB8Ay_5PS3kWg","stars":2,"text":"My girlfriend and I been dying to try this place for sometime, but never found the motivation to go until we saw the Anthony Bourdain episode when he was in Cleveland. We ordered the Family Meal (Full Slab, 8 Pcs of Chicken and 2 sides). When we ordered most of the sides were not available so our choices were limited.  I've seen their slogan around town \"Voted #1 for Ribs\" so we were excited, but after taking our first bite into those saucy ribs, we looked at each other and said \"meh\" as we have had better. The chicken on the other hand, drenched in BBQ sauce, was interesting. It was saucy yet crispy so it was an interesting dish, we probably favor the chicken over the ribs. The family meal is large so make sure you have plenty of mouths to feed, as for us we'll need to hit the gym for the next several days to burn off the calories we just packed on.","useful":3,"user_id":"Jyi0WJt0UfGdEg0grR38ZA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-01-04","funny":0,"review_id":"q0cL9c_IQPjaGFIA64COFA","stars":1,"text":"Worst food I've ever had the laziest service. We ended up throwing 35 dollars in the trash. If you like getting sick or experience all time lows check this place out!","useful":0,"user_id":"RyixLoQmLZt5BWp6xJZ5uQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-04-16","funny":0,"review_id":"tBtVsv9M__Zl4xqQ7xN9AQ","stars":4,"text":"Hot Sauce Williams is a Cleveland institution... Put in other words- you have to try this place at least once. \n\nThe sauce isn't for everyone. It's a vinegar based sauce with a little heat to it. I absolutely LOVE it but I know others who prefer a thicker sauce. I normally go with the 2 piece all white dinner with the sauce on everything. The fried chicken is some of the best in Cleveland. The fries, slaw and bread are all solid and for what you pay ($6.99 for my meal) you get a ton of food. The inside of the restaurant is very old school-- definitely not a place for suits and ties. It has a drive thru which is super convenient, especially considering the area it is in.","useful":2,"user_id":"3AC_liBwORA9w18CIrGxcQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-05-01","funny":3,"review_id":"qr9hC5-YKLjMBBT-DJ8Vow","stars":2,"text":"My good friend, a native Clevelander, described this spot as a Cleveland staple. In town for a Cavs game & we gave it a try! \n\nMy BF & friend had the pork shoulder & it looked great. They loved it, I tried it & wished I ordered it. It's on white bread & looks a little mysterious but it's delish. I ordered the chicken ...I waited....& waited for this stupid chicken. My friends & BF were done eating by the time I got my chicken *sigh* not cool. Luckily I got my sides first which were mac n cheese (dry and tasteless) and greens (ok). I was so excited for this place & what a bummer. The chicken was juicy but had no flavor. I am a white girl that grew up in Pittsburgh, I'm not asking for much in terms of flavor but my God this was tasteless. \n\nLet's touch on the location, def off the beaten path. I felt as if I were at a fire hall. The decor reminded me of a low budget bridal shower. It's positively outdated which is fine, it's a dive. I wish the food made up for the detoured drive, long wait & weird set up.","useful":1,"user_id":"II7eBcZJRLwnFtuS6BtVRg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2011-10-07","funny":0,"review_id":"91fnUQiklT741ypgwrNw-w","stars":3,"text":"Pretty solid \/ cheap chow.\nBut not BBQ\nLine moved fairly slow but i didn't expect fast food.\nStaff was polite and playful\n\nI ordered the chicken\/ribs combo. ($10)\n-The chicken was pretty tasty, but the sauce poured all over it made it instantly soggy.\n-the ribs are smoked\/grilled then BAKED. that said they had good flavor and texture.\n-the sauce is just plain not good. tastes like sweetened tomato juice.\nit worked okay on the ribs but ruined the chicken.\n-mac n cheese is meh\n-greens are cooked sweet. not my style.\n\nDef work a quick meal if you are in the area, but don't go out of your way.","useful":0,"user_id":"FDFJk0feR-RAGHkxRr_3Nw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2014-08-11","funny":0,"review_id":"1cnIDaTYinT2BNOD8aqCdw","stars":2,"text":"The polish girl was good overall but the sauce was a little too sweet for my taste. The fried chicken was also a plus.","useful":0,"user_id":"FkqkyifiYxBaajtYvAL3kQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2013-11-16","funny":0,"review_id":"gClPOdeAxVdcJByX5W5ojw","stars":4,"text":"I have been going here for at long time and its one of few places I can overlook bad service because I love the food. The wings are great, best wings in Cleveland but the best offering from here is the barbeque sauce. Better service and it would be 5 stars.","useful":0,"user_id":"C1TC9xbL-rbN8UspYPgXZw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-05-18","funny":0,"review_id":"0uZXvWjKqpYBI8n-eNU8RA","stars":4,"text":"I like to do Man vs. Food tours whenever I visit a city for work, and while planning for Cleveland, Hot Sauce Williams and their Polish Boy definitely made it onto my list of must eats. Man oh man, it did not disappoint. That Polish Boy is AMAZING. I'm a huge fan of your typical hotdog with coleslaw, not so much hot sauce or putting fries on things. But I'm telling you, this thing is spot on! The hot sauce wasn't too hot, the fries melded together with everything else in a special and tasty way, and the slaw and kielbasa were delicious. You have to try it if you get the chance. No wonder it's a signature Cleveland food. \n\nI did do the drive thru (after reading other reviews this white girl didn't want to risk going inside by herself late on a Saturday night) but didn't have any issue with a long wait - maybe 3 minutes tops. Glad there were no harassing panhandlers around either. I was bummed they were out of banana pudding but the strawberry cheesecake was ok. \n\nBottom line: go get yourself a Polish Boy!","useful":0,"user_id":"ZpiAtR4WReIbMy54vXNqtw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-01-06","funny":0,"review_id":"n_mIIi1mNSqyOGGNEI9Q8w","stars":1,"text":"All I can say is that both the food and the restaurant were completely disgusting. The pork shoulder tasted like it was two weeks old and reheated in a microwave. Their fries were cold and mushy. The cole slaw was the only edible thing they gave me. The whole meal was so bad I threw it in garbage after two bites. To go along with the terrible food the inside of the restaurant was dirty and had a strange smell. It's probably not necessary to say, but I will never set foot in Hot Sauce Williams again.","useful":0,"user_id":"hx6_lI8_JlwtCoeVJId9ZQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2010-03-15","funny":1,"review_id":"h4XxiPjntIPhjFAFegQh9Q","stars":4,"text":"Hot Sauce Williams takes the best BBQ in Cleveland in my option. The home made mac and cheese is astonishing. The chicken is drenched in sauce and you just have to saver the flavor. I love to lick my fingers clean to finish off my meal.","useful":1,"user_id":"T1XUUXIEU5uj3NmdWAdIlA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2017-05-27","funny":0,"review_id":"t_JpuqPSeeBpDpWRKb-zFg","stars":3,"text":"Painful to watch this slow disorganized mess try to handle just a few orders at once. Took 30 minutes to get our food and that was because we accepted other chicken pieces than what we ordered because they said it would take longer. Short story long: if you're in a hurry this isn't the place for you.\n\nOn a positive note; the ribs were very good even with a little too much of their hot sauce on them. But the ribs weren't incredibly meaty. The chicken was nicely fried, but they put a bit too much hot sauce on it. The fries and mac and cheese were good with the hot sauce. \n\nAn odd mix resulting in a 3 star experience","useful":0,"user_id":"eO7Wam6CD5-2xE4tfqFFkw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":3,"date":"2011-12-09","funny":1,"review_id":"EM1aHX7DsSAKDoqYOocyTw","stars":4,"text":"The chicken isn't what makes this place great.  It's good but it becomes something different entirely when you smother it in the signature sweet, juicy sauce.  My God, I'd smother my limbs in this and eat my own arms.  It's that good.  Get that and some of the mac n cheese and you're in heart attack heaven.  But it's so good you won't care!  Also, all this crap about \"Oh i might get shot\" or \"Don't venture here at night\".  This is Cleveland, kids.  It's rough.  But I'd rather venture into a rough neighborhood than spend my time kickin' it at Applebee's in the safety and comfort of some designed suburb eating crap ass Jack Daniel glazed \"riblets.\"  Do yourself a favor, venture out of your comfort zone and get some good chicken...and extra sauce  You'll be super happy you did.","useful":2,"user_id":"jHX2qMpRIg-W32vJgi50lw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":7,"date":"2010-05-19","funny":5,"review_id":"QPa95SRzS7JrrCtENK9l2w","stars":4,"text":"This is probably going to be one of my favorite places that I stopped at on my cross-country trip...thanks yelpers for letting me know it's worth going to the shadier part of cleveland (which isn't THAT bad) to get my grub on.\n\nThe two things you have to get when you go to this joint are the macaroni and cheese (my husband says it's the best he ever had and he's a snob when it comes to fatty foods) and the fried chicken (this was so juicy and flavorful on this inside and deliciously crispy on the outside). OMG, seriously run there is you have the privilege of being in Cleveland. \n\nOh, and a few other pointers:\nCornbread was not good at all.\nI didn't try the coleslaw because it was super lathered in mayo.\nWe also had the pulled pork sandwich, which was really good too. The bbq sauce is flavorful, but not hot at all. I liked it on the pork, but I'm glad I didn't get the fried chicken drenched in the sauce - better on its own.","useful":7,"user_id":"ZJCWUrxd2YzEj5yLshYn8A"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2013-02-19","funny":0,"review_id":"yUo2luFZRp9_oqRE_6hvjA","stars":4,"text":"I know others have been moaning about their service, but our experience last Sunday was great. \n\nWe were disappointed about the dining room being closed, but the drive through was open and the staff were very patient with our endless debate about what to order (our son can be finicky). They even chimed in with recommendations when they told us that Fried Okra was unavailable.\n\nThe food was incredible -- and really messy in the car as we scarfed it down on our way back to NYC. We had Polish Girls, Mac and Cheese, Black-Eyed Peas and a Pork Shoulder sandwich. The sauce is really special. \n\nWe strongly recommend it to everyone. Great food, great service, really cheap.","useful":1,"user_id":"-WzyS1gUd85rrgPbLKWnEw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2011-03-08","funny":1,"review_id":"9aCTKXLxKTNBJEhpXUY-1g","stars":3,"text":"This is a funny place.  Being from Youngstown, and not Cleveland, I went here after my Cleveland Clinic appointment, because I saw this place on Man vs Food.  I went there for one reason only...the Polish Boy.\n\nThe service staff was really under-enthused to wait on me...even though I was only 1 of 4 people in the whole joint.  The 1st lady who I said hi to pointed me in the direction of the stack of paper menus, without saying anything back to me.  \n\nThe Polish Boy, was not on it.  But after asking the lady at the counter, they DO still have it available.  It's a kielbasa on a bun, topped with fries, coleslaw, and BBQ sauce.  The TV show also added pork shoulder to the sandwich, but for some reason, they didn't put it on mine.\n\nIt was awesome nonetheless.  \n\nThe place was a dive, doesn't look that clean, and it's located in a not-so-great side of town, and the service was lacking any personality.  However, the Polish Boy was GREAT.  I would definitely have this again.  I hear their other food is good too, but the PB is all I wanted.\n\n3 stars for the food.  0 stars for the service.\n\nLetter Grade:  B","useful":2,"user_id":"ZEwpJOG8PFlHiFRdAZZ0iA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":2,"date":"2011-08-18","funny":5,"review_id":"VzP7FDWc9YwWihxR59rDpQ","stars":4,"text":"I wont lie.. I was a little scared to enter this restaurant. I have always wanted to eat here but the location on Lee has a horrible reputation for .. well if haven't heard.. picture the scene from Animal house when they all walk into the bar where Otis is playing.. Nuf said. \nI had heard that Man Vs Food was at this location, so i figured i would give it a shot. Upon entering most places the food network has been you will notice that not only do the places raise their prices, but pictures and plaques are everywhere commemorating the event. Had you not seen the episode, you would never know they had been there.. Its as if they couldn't have cared less.. \nSo i asked the girl.. \"Whats good\"  and with out even hesitation she fires back \"You gotta try the polish girl and you might as well have the fried chicken too..\" With that type of certainty.. i had to reply \"Well. OK!\" She then asked me \"You want our sauce on your chicken?\" To which i asked \" I dont know, do i?\" She promptly said yes and ladled it on. For those who dont know.. A polish girl is a sausage (hot dog like) on a bun with french fries, pulled pork, coleslaw and their sauce.. Its about as good of a sandwich as you will ever taste. \nNow fellow Yelpers.. I have been known to exaggerate a little to heighten the effectiveness and entertainment value of a good story.. But i say to you today.... That is the best fried chicken that has ever passed my lips. The very wise and helpful woman who took my order was appreciated ever time i took a bite of that chicken. That sauce.. complimenting an already outstanding chicken breast.. I well up with tears just thinking about how unbelievably good that food was. \n\nOn another note.. Buy a F*cking mop already.. The place is absolutely deplorable. I needed rubber gloves and a hasmat suit to enter the place. Seriously... what is that 10 years of grime on the molding? Its absolutely disgusting. How you havent been sited is beyond me.. Perhaps people are so blinded by the food (as i was) that they don't notice or care. You would have had 5 stars, but i just couldn't get over how dirty it was..","useful":5,"user_id":"VOUnXOlll52vwQcJK1tm8A"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":2,"date":"2012-06-14","funny":0,"review_id":"2FJ_j0d4jY1hA65v94vc0w","stars":5,"text":"I had always seen this place growing up, but I never actually tried it until this past Christmas! The fried chicken was probably the best I have ever had; worth every calorie! I had the sweet potato fries and they were great and crispy.  Everyone was really nice; the cook even came out and took a photo with us when I told him that I was visiting and had always wanted to try the place! I will definitely be coming back!","useful":1,"user_id":"9BeV9g26iBVMkDPRWjW3AQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-01-13","funny":0,"review_id":"ZUysgXDo-0nv4ZAl2CE4WA","stars":4,"text":"Um, can I just say that I want another 15 orders? This stuff is so so delicious. It has had rave reviews from all sorts of TV shows and I had to try. So last night, after a full weekend of eating, I decided I could just put on some super loose eating pants and go and get my fill. \n\nWe ordered the rib tip meal and the thigh snack. The rib tips were well cooked and the SAUCE! That is the winning ingredient. The ribs themselves were a little bit tough at times, but that sauce is really what makes your mouth water. We also got the macaroni and cheese as a side and as a not usual fan of mac and cheese (I KNOW, I'm the devil for saying such ludicrous things) I wasn't expecting to finish the ENTIRE tub by myself. My boyfriend wished he acted faster, because he just got a small taste. \n\nWhat you have to be careful about when you go late at night is that they close the doors and you have to order in the drive through. The intercom doesn't work so you drive up to the window and order. They take about 5 to 8 minutes to get your order. During that time, there will be homeless people that approach you. If that's not your scene, you won't score some awesome ribs. The environment its in is not great, but the food will surely make you want to come back.","useful":3,"user_id":"GefiDYsb2U_-3ujGnheSpQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2013-05-20","funny":0,"review_id":"nXVeJxHQ_-vBYIO61lNqUw","stars":5,"text":"Forget about the place and service (which were fine) and let's talk about the food!  The Polish Boy was good, but the fried chicken was AMAZING!!  And the sauce was killer!","useful":1,"user_id":"4p87ApJJWOgqfJ-DnVnVgA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2014-09-26","funny":0,"review_id":"4wGo32rPfWCt7J6S61pdzg","stars":2,"text":"So torn. I love their food. We wanted a polish boy. Yelp says open until 1:30, it is 10:26 pm and drive thru dude says they're closed. What? If you're normal and visit during normal hours, I gave hsw 5 plus stars. But consistence is nice too.","useful":0,"user_id":"r_dYnqAQf4_G5T0ekGFyyA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":3,"date":"2014-07-22","funny":0,"review_id":"9gwDQXFyjNuZpY0FfZ4_Ag","stars":5,"text":"The chicken and po boy was amazing. Possibly the best I ever had. Get it with the sauce loaded on the chicken and fries. Staff was super friendly. \n\nI will come back next time I am in the neighborhood I visited because it wAs a nice walk from the Cleveland clinic. Probably not the best idea at night but during the day it was great.","useful":1,"user_id":"Sxjc78bgN4xMrIkzvnrUjw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-07-31","funny":0,"review_id":"hEeajeUzkW2wABDE4SXF2A","stars":3,"text":"The food is good but the service is slow.  This means do not go there for a quick to go food.  I ordered a side of \"mac and cheese\" and fries.  The \"mac and cheese\" was already prepared but it took them 20 minutes to get my fries.  There was no sense of urgency amongst the entire staff, they just assumed everybody came to spend their entire day in the restaurant waiting for food.","useful":0,"user_id":"79Vv70bMS1JC9ASCg4dWqg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":6,"date":"2013-09-15","funny":5,"review_id":"jjj5tomYOQt1ZBVE67eOTA","stars":4,"text":"Hot Sauce Williams is definitely a guilty pleasure of mine :) My favorite dish from here is the fried chicken and ribs dinner. For sides, I get the sweet potato fries and mac and cheese. They give you sooooo much food for just under $12! \n\nThe servers work only behind the food stand, so you pretty much have to clean off the tables yourself. You may at first be deterred from this place by its lack of cleanliness, but the food is so worth it!  One thing to keep in mind, they don't provide free water, but a bottle of water is only $1. \n\nDefinitely worth checking out!","useful":8,"user_id":"SaSXRzjHx3SMTNnW90PetA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2012-07-12","funny":0,"review_id":"ps3VgpN6crAzfjQMXS6jFA","stars":2,"text":"The chicken was good, just good.  The hot sauce isn't 'all that', in my opinion.  The fries were nothing special and the mac and cheese was greasy.  The staff was not at all friendly or welcoming.  Oh, and since when is a chicken sandwich two pieces of chicken on the bone and two pieces of bread?  Take it off the bone and put it on the bread yourself?  Want the hot sauce on the side?  It's an extra 65 cents.  The coleslaw was okay.  Maybe other locations are better......","useful":1,"user_id":"4cLAnzMc0ga57b_ICAMqbw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":2,"date":"2014-12-21","funny":0,"review_id":"uQYd8WMYsisMVTH-YOtQlA","stars":5,"text":"Let me just apologize to the food gods right now for having taken 20 years of my life to finally try this hometown legend. \n\nI had heard that their fried chicken was possibly the most delicious thing that could ever touch your lips but my god.... I'm speechless. I've had so much amazing fried chicken I can't even think, but Hot Sauce William's was so far above anything I've ever tasted. It had the perfect crisp yet the chicken was\nmoist n juicy n the breading was heavenly not to mention his signature hot sauce was sooooo &@*!%# delicious it isn't even funny. I had the 3 piece dinner special for about $9 to go and some is still left in my fridge eagerly awaiting tomorrow morning. Leftovers have never sounded so good!\n\nTwo huge thumbs up! I'll be back next week!!!","useful":0,"user_id":"Q3kjcFXgFtCLaPAAhzc_Zw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-04-28","funny":0,"review_id":"olUly_Xc5_RJBgKWg4D4Mw","stars":1,"text":"There wings are 1.50 a piece and small I ask for fresh ones she told me no I see y they always close and dont make any money They rude ghetto the beef polish boy cold fries cold sauce nasty","useful":0,"user_id":"aKtwHb1VPg0P21N2Rv0rSQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-05-21","funny":1,"review_id":"U9lPU7cB-nwmpdAuF1ZSaQ","stars":1,"text":"I am a Cleveland resident. I have been to Hot Sauce Williams many times and I would normally describe it as being just okay. It is a decent rib and chicken joint but I've been to many that are better. I only go there because I don't have a car and it is right near a city bus stop.\n\nI visited on Friday and I must say I was extremely disappointed. When I arrived there a woman was standing in line. I sat down because it was very hot and I wanted to rest for a second before I ordered. I asked my boyfriend to go find us a menu. The woman who was in line suddenly became angry. She yelled \"I guess no one's gonna help me.  I've been standing here for 10 minutes. I'll take my money elsewhere\". She stormed out angrily. My boyfriend then came back stating that he could only find the second page of a menu (which only showed family meal deals). We looked over it but found that none of the items were good for just two people so we took the menu back to the front counter. We stood there for about 10 minutes when finally a worker walked up to the counter and rudely said \"What?\". We asked could we get the other page of the menu to which he replied. \"Nah. That's all we got\" and walked away. During our time there we witnessed 2 other customers treated the same both of which left. \n\nWe remembered Uber existed and we caught an Uber to another restaurant.","useful":9,"user_id":"YFwhEgu6mOFkZ_fqRYmzhQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2011-03-02","funny":1,"review_id":"hZ_KSegI5fqyVKoll0NE_w","stars":4,"text":"I can see why this would be a neighborhood hangout: Everyone is friendly and seems to know each other; basketball games on the one TV so this hardly qualifies as a sports bar; and great food at reasonable prices. I had the Sunday dinner of brisket with three sides - candied yams, black eyed peas, and fried okra - wonderful. My only complaint is no beer and water comes in communion sized glasses.","useful":1,"user_id":"SUdx5x74OG7E9YhTplpwaw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-06-25","funny":0,"review_id":"97iafk9j7UixRvQLrHRxrQ","stars":1,"text":"Gross food, gross atmosphere, rude employees. Got the pork shoulder sandwich. It looked like a plate of soup with sauce and coleslaw and soggy bread. The meat tasted old. Dining room was atrociously dirty with a boom box on too loud. I don't understand how this restaurant is a Cleveland staple or how it was on so many TV shows. Never would I go back there. Felt sick afterwards.","useful":2,"user_id":"NF5WrQ-KpT-RPHQ9Lu-CAQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2017-05-04","funny":1,"review_id":"XnqUquog7SyzW6G4cV5Jew","stars":3,"text":"My favorite spots are dumps. This joint is no exception. Food's great. Staff are cool. Value is there. I would like to know the origin of the fried chicken batter recipe because it bears an amazing resemblance to B&M BBQ's sweet tempura like quality. Cabbage was a bit chemical fire tasting. Granted I came in later in the day. I have to think this place rules at say 11:15 AM and 6:22 PM. I need to call ahead to see what time the pans hit the steam table. You know what I'm sayin'?","useful":1,"user_id":"CBeZvUAazk_eHnSD-ZF7YQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":3,"date":"2011-01-18","funny":7,"review_id":"GLY-lZNJCoq2qixYsG35wQ","stars":2,"text":"I haven't seen this much pink and aqua since the days of Miami Vice! The decor of Hot Sauce Williams doesn't look like it's been updated since the 80's-esque crime drama either. \n\nYeah, I get it. Bourdain went here. An episode of Man vs. Food was shot here. East 79th & Carnegie has never seen so many white foodsters flocking here because their favorite TV-foodie says it was good. It's an institution to some. Criticizing it would be akin to criticizing your Mom. Despite all of that, I will still go on record as to saying that Cleveland STILL doesn't do good BBQ. At least no public place that I've found yet does. \n\nHot Sauce Williams is kind of overwhelming. A lot of locals seem to come here. They know what they want even before they arrive. As you enter, a line forms, similar to that of a fast food counter. Place your order, pay, wait for the already prepared food in chaffing dishes to be sauced and packaged and eat it either in the dining room or take it to-go. But wait; there's no menu on the wall! Luckily I found a stack of paper in the dining room that resembled a menu. In no specific order or fashion, the piece of paper spouts off an assortment of food offerings and prices. A different piece of paper that's plastered to the wall says something about substituting sides will cost an additional 85-cents. \n\nThe typical dinner will include fried chicken\/ribs\/pork.etc, a side of slaw, fries and bread. I ordered the chicken dinner. The slaw looked way too liquidy for my tastes, so I upgraded to the mac & cheese. The chicken, smothered in hot sauce was bland, un-crispy and tasted like it was sitting around for a while. The fries were packaged frozen cottage fries (not fresh cut) with their signature sauce dumped on top. The mac and cheese was overcooked and so tender, it almost melts in your mouth. I'm not sure pasta should dissolve like that. They were unfortunately out of cornbread when we went, so we got slices of Wonder bread to go along with our meal. The whole dinner, packaged in a Styrofoam to-go box had to be rubber-banded together because it was overflowing with food. \n\nThe meal was good in a sloppy, messy, down-and-dirty kind of way I guess. That's the way most BBQ is meant to be eaten I suppose. I was just completely underwhelmed by the whole thing. I do BBQ at home in the summer. I have a wood burning smoker where I smoke meats of all varieties. I make cornbread in my cast iron skillet. I love greens and mac and cheese. Needless to say, I've had much better at home and with not much effort. I know the potential for this type of cuisine and I'm not giving this place any sort of break because it's a so called \"Cleveland institution\". Cleveland deserves better BBQ.","useful":11,"user_id":"An8Q0oLP_2juwErLw90L8A"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2013-04-23","funny":0,"review_id":"QqNB7wseyGH6iVmIW_SOPw","stars":3,"text":"So I was really interested in this place because of the Man vs Food and other foodie reviews and publicity.  To say that its in an interesting section of town is an understatement.  The location is a bit rundown and the interior might need a good scrubbing.\n\nWhen I came in at 1245p, there was no fried chicken ready, no greens and it didn't seem that they were ready to serve customers for lunch.  The place was pretty empty though.\n\nI asked if they had any chicken and it was 6 minutes until it was done.  I'd wait.  Ordered the two piece and mac\/cheese and cole slaw.  Total for that was about $10.\n\nFood arrived... no frills.  Cole slaw was darned good, wished there was more.  Mac & cheese was nothing special.  Chicken was great.  Not especially tasty flour coating, but the chicken itself was PERFECTLY DONE.  Not 1 degree too little, not 1 degree too much.  Melts in the mouth.\n\nFor the food, I'd give it a 3.5 stars.  The decor gets one star.  But food trumps decor...","useful":2,"user_id":"SwjaMXIoXKKLmH_MX6aXrQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2013-09-09","funny":0,"review_id":"U6hKP4uqWNhswS5OzVudjQ","stars":1,"text":"Maybe Mondays are just bad days. Went for the fried chicken. I had a breast - dried out boneless breast ; a thigh - super crunchy but greasy beyond belief and so over cooked that thigh meat had receded it its hardened shell; and a wing, also overcooked and greasy. The coleslaw was ok, but not enough to save the day. The candied yams tasted liked canned yams in the liquid they come in. Maybe they ran out of the butter you need to make candied yams. At least the coke was cold. Oh, I almost forgot the sorry excuse for a corn bread muffin that it came with -dry, mealy and tasteless. By far the worst thing I have ever eaten in Cleveland. I hope the fried chicken is better in Memphis.","useful":2,"user_id":"h3EvUnccfQ1-1fEQmIaGSA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2010-07-04","funny":1,"review_id":"JeNpKHeZXblJfshQgcsYeg","stars":1,"text":"Went for the second time on Thursday 7\/29\/2010, and Danielle, the completely indifferent cashier dropped the ball on my order, and I had to wait 40 minutes to get a bloody catfish sandwich\n\nDon't get me wrong, fried catfish was outstanding, but being treated like trash will insure I don't return, which is unfortunate because I am very loyal to my favorite eateries.\n\nBelow was my first experience.\n\nI'd heard good things about this place on Yelp, and it was okay.\n\nI had the fried chicken, which was actually pretty good. I regret letting them douse my chicken and fries in the bbq sauce though. There's something that just doesn't gel with fried and bbq chicken. I really did enjoy my mostly sugar orange-pineapple drink. The coldslaw was boring.\n\nThe ambiance was nice, but the server(s) who took my take out order couldn't have given two craps about customer service. I'll give it one more in the hopes that my experience will be redeemed.\n\nThe food came out relatively quickly though.","useful":3,"user_id":"OP1jgh0eoc6taMwCwwTN4Q"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2011-06-21","funny":1,"review_id":"7PAIYrwX_82v4KvuZGorZg","stars":4,"text":"Originally saw this place on Man vs. Food.\n\nI definitely like the food here and everything is pretty good. The chicken, the ribs, the hot links, and the sides are delicious. I particularly like the po boy. I think it's something like a hot dog or hot link in a bun, topped with cole slaw, french fries, and covered in sauce. And it's around like $4 and some change. For less than $5, it's a value and really good. \n\nIf this place was a little closer, I would definitely come by more often","useful":0,"user_id":"mK-muLy9-EFuLapKZJZoDg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":2,"date":"2012-04-30","funny":2,"review_id":"iCl9wtAXKQcPgPK20CA-Ng","stars":5,"text":"Best fried chicken in Cleveland... best barbecue sauce in the world. I always take out-of-town visitors here and get a bunch of fried chicken to go.\n\nMy friends and I come here every few months to clog our arteries with the awesomeness that is Hot Sauce. The fried breading on the chicken is so amazing that I inhale it into my stomach every time... the chicken is so moist and tender that it melts in my mouth... the sauce is so flavorful and unique that I put it on everything. Yes, the location is ghetto... the ambiance is ghetto... the service can be unreasonably slow at times. But the food is what keeps me coming and what gives HSW 4 stars.\n\nOverall, if you want legit fried chicken in Cleveland, I highly recommend Hot Sauce Williams.","useful":2,"user_id":"Tnf_zHip7OeYy93v3vKp1g"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-11-20","funny":0,"review_id":"OtmXFNG09CozGZShjWQ8TA","stars":1,"text":"They do not keep the hours they advertise, service is rude, food is cold, such as  shame.","useful":1,"user_id":"T76-jKiHe5Fz5qTjQQlWoA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2010-09-19","funny":4,"review_id":"oze66inN_eyiiybgW7SW-w","stars":4,"text":"If you don't like this place, you're racist.\n\nJust joking.\n\nI had the fried chicken and ribs dinner, which included a breast and a wing of their unbelievably crispy and delicious fried chicken, two large ribs, which were tender and smothered in tangy bbq sauce, and a side of mac and cheese and baked beans (both great).  As many on this site have written, the decor and location aren't the best, but don't let that discourage you.  If you're in the mood for southern style soul food and in Cleveland, check out Hot Sauce Williams post-haste.","useful":1,"user_id":"P9juBjTdlzDlrxb6uMqSug"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2012-01-05","funny":0,"review_id":"bBPoWSY_bvbDK7eKj39Arg","stars":2,"text":"Got takeout from here last night.\n\nThe good:\nThe Po Boy is solid.  Very tasty, as was the Mac N Cheese\n\nThe decent:\nChicken Sandwich -  Just so you know, as we learned, a chicken sandwich here is simply fried chicken on the bone with two slices of wonder bread.  So hence, not really a chicken sandwich.  The skin could have been crispier, it seemed a bit too spongy, maybe old oil?  Not sure, but it was just ok.  The sauce that comes with it is more of a tomato based typed hot sauce, sort of a mix between hot sauce, tomato sauce and bbq sauce which I liked, but my wife didn't care for.  The Green Beans were average.\n\nThe bad:  No sweet tea, the tea they have is a can of Nestea.  Also the drive thru service left much to be desired, the person taking the order was hard to understand and a bit rushed. The food did come out quickly however.","useful":0,"user_id":"ZNkpsi353TRp2AhFFT9V-Q"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-08-16","funny":0,"review_id":"4wG5WctC5AL9yFBTR0Tuig","stars":1,"text":"Never tasted a worse barbecue sauce anywhere.  I got the signature ribs and sauce, with fries, & slaw.  The sauce had a tang to it that I should have recognized as spoiled, and the ribs were dry.  And to make matters worse, all of my fries were covered in the sauce?  Our waitress was very nice and helped guide us through the menu.  However, the food and cleanliness was substandard for a supposed Cleveland Icon, or any eatery for that matter. Lots of fruit flies and the itsy-bitsy spider enjoyed watching us eat from our window sill.","useful":1,"user_id":"m5iFZbW5hSNPNplx-vGkyA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2015-03-26","funny":0,"review_id":"WwguSZx4VHhtYcXo9F8n7g","stars":5,"text":"I genuinely love this place. \n\nMy one request is that this place should start a delivery service. The neighborhood isn't the best, and since all my friends in Cleveland are Case students, no one is really inclined to answer my fried chicken hankering at 10pm because to them, the fear of getting shot is too damn high (but I think i could die happy with some HSW in my hands).","useful":0,"user_id":"aET30aMEQQLWz1oNGd-DBQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-11-13","funny":1,"review_id":"F3b3-mmClvVPUT0WvK_guA","stars":4,"text":"First let me start off by addressing the negative dine-in reviews at this establishment. \n\nI think of Hot Sauce Williams as one of those places where you would never imagine eating your food inside. It's more of a pick-up and go. I mean..really..once taking a look a the decor, WHY WOULD YOU WANT TO? Kind of reminds me of several of the Chinese restaurants in Cleveland. Yes, there are places to sit and eat, but why would you? \n\nIt's a take-out centric establishment\n\nNow getting that out of the way I can say that hot sauce williams has pretty good wings. Probably not, \"OMG THE BEST I'VE EVER HAD\", but they're good. \n\nRibs can be hit or miss..and I'm not a polish boy fan, but I can defintely say I've been coming here for the wings for over 10 years. \n\nJust try it out with an open mind..and opt out of dining in if you're easily disgruntled by the surroundings. OH YEAH..and mostly everyone who works there has an attitude problem out of this world. It's not gonna stop so you may as well just remain numb to whatever interaction you have...because more than likely it won't be pleasant.","useful":1,"user_id":"hYBa2DvaRSAuI6Xm9q4I-A"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2013-06-19","funny":1,"review_id":"Q_Rznzq9nRZxGGlEPvaDYA","stars":1,"text":"I was going to do 1 word to describe this, but couldn't decide between YUCK, GROSS or DISGUSTING!  Take your  pick.  I'm going to go throw up now.","useful":5,"user_id":"2psu7_9YwuGeb26ptYxn4w"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-10-27","funny":0,"review_id":"z3_ozD9yyl1uksiq9yjjVw","stars":1,"text":"My bf ordered a polish boy dinner(7.99) he corrected him 3 times that's it's a polish boy combo not dinner. He wanted sauce on his polish boy (60 cents) I ordered a wing dinner (8.49) I wanted Mac and cheese with the dinner (1.49) I wanted sauce on my chicken and wings (1.25) the dinner comes with a beverage I wanted bottled water (1.25) ... That was the last straw I asked why was there a fee for water when it comes with a beverage he told me if I wanted I could have a cup of water ... I politely declined and left. I'll pass next time I'll go to B&M","useful":0,"user_id":"URL8nL-6BHft1E5nyzhPOQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2010-05-17","funny":1,"review_id":"g8qVFu0pGY2MpMbJ1CW46Q","stars":2,"text":"SLOW SLOW SLOW!!!\n\nI'm a vegetarian but was the driver for my group of friends.  I didn't' mind that there were only a few side dishes that I could order. But, I ordered fries and it took 25 mins for them to have them ready for me.\n\nMy friends enjoyed their chicken but we were all upset about the 25 min wait at a \"fast food\" restaurant.","useful":0,"user_id":"XsidR33reGV0sdVHFeKxQA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2011-03-13","funny":0,"review_id":"Qk6pRf5NM69-pd0JC66uug","stars":3,"text":"Yes while featured on several national food TV shows Hot Sauce Williams relies heavily on their reputation more than anything.  Don't get me wrong, the food is tasty just not to the level that one would believe watching the television shows.","useful":0,"user_id":"N5E3KDv9O5lsHfG7f8YvHg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2014-01-19","funny":0,"review_id":"_yIGySsH3MmaUNoD0lw1lg","stars":3,"text":"The review and the rating we may be contradictory. I would base ratings on overall experiences. This place falls well short of service and decor excellence so you have to be prepared for that when coming here. The location is also not ideal. By that I mean it's not located in the best neighborhood. \n\nNow, with that being said, the food definitely makes up for it. And whether you're a Clevelander or here shortly from out of town, this institution is worth a visit. \n\nWe ordered the Polish Girl, 3 piece chicken dinner, Mac and cheese and greens. First, I'll start with the chicken, and quite simply the BEST I've had. You will find yourself breaking off pieces of that super crispy and delicious skin and dipping in their signature sauce (which should replace ketchup everywhere!) If you're like me and tend to stay away from pieces of white meat with the fear it will be too dry, fear not, the white meat pieces are just as tender as the dark pieces which is always a good sign of perfectly fried chicken. \n\nNow the Polish Girl. Wow ok. You will keep your hands clean because this is a fork meal. This is a spectacle of meat-in-tube form. A kielbasa covered with pork shoulder, topped with fries and that sauce! If your that crazy, get the slaw on top of that! The beauty of this tangy sauce they make is that it an pretty much go on everything. \n\nThe mac n cheese was so-so, but I'll never eat fried chicken without it. The greens are epic. Even if you don't really like greens or if you've never had them and don't think you'll like them, get them. They're amazing.\n\nThat being said, if you want a kick-ass comfort, stick-to-your-ribs meal and want to throw everything you know about dieting out the window and you can look past the horrific pink and blue, dated and a little grimes decor and don't really give a hoot about service as long as they bring you the glory that is being made in the kitchen, this place is a MUST!","useful":0,"user_id":"d6VGtpQ4216ZUuZsQUI9jQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-05-28","funny":0,"review_id":"YtJPRlpSGS1EEUXuniyUrA","stars":4,"text":"Chicken and sides were fantastic.  I like my BBQ better but neat place with good chicken.","useful":1,"user_id":"fplKErEvQvDIwzri3C8pjw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2015-01-31","funny":0,"review_id":"mCY2nLEpDow5usum7nHGOA","stars":5,"text":"THIS PLACE IS THE ABSOLUTE BEST BARBECUE IVE EATEN IN MY ENTIRE LIFE! We came up to OH for a wedding and ventured out to get some of the Man v. Food- famed food, and it didn't disappoint. Definitely worth making the trip up from Maryland.","useful":0,"user_id":"IrODXIGqyoqEpAk1xfO8pg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2013-02-05","funny":0,"review_id":"u39IziXSo_ekV7DIOD_1JA","stars":5,"text":"Best soul food I've ever had...this restaurant is one of the must-visit attractions of Cleveland. Best cole slaw I've ever had and the fried chicken dinners are one of a kind. You have to try it to believe it!","useful":0,"user_id":"SkueY7hVsyXmYItELoodGw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-04-28","funny":0,"review_id":"qjnUdADRs3G9DFyiygNVUw","stars":3,"text":"I had to try it once but didn't enjoy the food much. I ordered a polish girl and a couple of pieces of fried chicken. I also went through the drive through which may have been a mistake as there was a bit of a long wait and confusion. Nothing too bad but not worth a repeat visit in my opinion.","useful":0,"user_id":"bK5l6tLywoLXZ9Nf9By3Uw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-01-10","funny":0,"review_id":"Ya29n1jX1rb7VUbceXWv1Q","stars":3,"text":"Hotsauce Williams is a small little BBQ joint located on Carnegie in Cleveland, Ohio. \n\nThe food: Absolutely delicious. I have never had a single item I did not love from Hotsauce Williams. While the quality of some of the food isn't top notch, it TASTES amazing. The fries seem like they're frozen, but when they're drenched in the house BBQ sauce they taste great. The slaw is absolutely delicious, and I don't even like coleslaw. All the meats are delicious as well. What it really comes down to is the fact that everything is smothered in their BBQ sauce, which is delicious. I give the food itself a 4 out of 5.\n\nThe service: the staff is sometimes very apathetic and slightly rude. There's a lot of young people working there, maybe relatives of the owner, I can't say, that don't really seem to care about their job or whether or not they're giving you good service. I have heard many people complain about the staff there, though I've never personally had a problem with them. The demeanor of some of the younger workers is a little off-putting. I understand it's probably just a part time gig for them while they attend school or something, but it's good to have at least a decently positive attitude at work, especially when dealing with customers. This is balanced only by the owners friendly and happy personality. Every time I've seen him there he always asks me how I'm doing and makes a point to come over to my table and ask how the food is. I give the service a 3 out of 5.\n\nThe atmosphere: honestly this is not the cleanest place around, by any means. The place looks a little old and run down, which gives it a sort of mom and pop shop feel I suppose, but you would think they would put a little money into updating the building\/decor a little bit. The place is sometimes packed, sometimes completely empty. They give you enough space for seating and the lighting is sufficient so that's a good thing. I give the atmosphere a 3 out of 5.\n\nOverall I rate Hotsauce Williams at a 3.3 out of 5. This is not the place you go when you expect a five star meal where someone is gonna car park your car for you and give you a foot rub after you finish your slaw and fries. Not at all. This place is more about the food and for that reason I'll definitely be back again. I would recommend this restaurant to someone who really enjoys BBQ food and isn't too picky about service or atmosphere. Needless to say whether you're a native to Cleveland or the Greater Cleveland area, or whether you're just visiting from out of town you definitely have to check this place out at least once!","useful":1,"user_id":"hbuyoFMC5UbxWIxVHYipwA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2011-08-23","funny":0,"review_id":"WxMIcLfeiKQlN-ICmqZdhQ","stars":1,"text":"This place is really bad. The food is sitting precooked on a very dirty counter under a heat lamp. Everything is soggy and messy. The whole place is filthy and the employees have a terrible attitude. Yuck.","useful":1,"user_id":"9JXtMjyw_tyjcBmnhMSvoQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":2,"date":"2014-05-29","funny":0,"review_id":"mP0azRQgV93ou6HgvLKtbA","stars":5,"text":"Mo was the manager\/server.  She was excellent.  I was visiting my hometown and had to take my other non-locals here to experience the BEEF polish boy.\n\nI ordered the Perch Dinner with Double Fries....gotta have the sauce on the fries.  It was excellent, as always.  Great crust to the perch.  A lot of fish for 8.95.  \n\nWe were treated to desserts, such as sweet potato  pies.....homemade pies, not that frozen mess.\n\nI couldn't eat all of my food.  Really nice sized order.\n\nThe BBQ sauce is the best.....but the packets of hot sauce are no good.  Stick with their homemade , signature SAUCE.","useful":1,"user_id":"uHpl6vRuuu2hIg6orTrWYw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-05-29","funny":0,"review_id":"rqCoEJsnwHbsmvWEicNn_g","stars":2,"text":"In town for Indians game and decided to try Hot Sauce Williams BBQ on Carnegie.. We ordered Polish Girl Deluxe, Polish Boy and 1\/2 slab of Ribs... Ribs were covered in a delicious sauce... The ribs were huge but not very meaty... Grisly and majority of the bones had more gristle than meat... Fries were below average.. Typical crinkle frozen fry... The sauce is good but if you get the sauce with the fries and\/or your polish girl or polish boy.. They totally drench your sandwich and fries so they become  a soggy mush. The sandwich was ok, however don't expect to pick it up.. So much sauce on it bread falls apart ..I don't mind a messy sandwich but this sandwich was water logged with sauce... No knives just plastic forks makes eating open face sandwich difficult...While I was there I asked for a cup of water was told they don't have any... The interior of the place is below average, tables were dirty restrooms were dirty(woman's restroom closed)!! The service was slow, people not very friendly... Overall disappointing experience for a so called \"Cleveland Original\". Maybe their Fried Chicken is better. I'll never know because I probably won't go back.","useful":0,"user_id":"CgcF4eqDc9vpVxAycKIw-w"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2011-12-10","funny":0,"review_id":"bVnOMXiVaPCRkK95cSOf-g","stars":4,"text":"I walked in just after 11 a.m. on a Friday. The lunch rush hadn't happened yet, and the place had a sprinkling of customers. I wasted little time in ordering their Polish Boy ($3.99): a deep-fried spicy kielbasa is placed on a bun, topped with cole slaw, french fries, and their house-made sauce.\n\nDeep fryers do such awesome things to food. I enjoyed the snap of the kielbasa here. The sauce and the creamy slaw packed great flavor -- and made this Polish Boy a bit messy. I don't think I had crinkle fries since my elementary school days, so a bit of nostalgia there. I ate my food in the car, so I felt compelled to bring out my \"namby-pamby\" side and eat it with a fork. The bun could have used some toasting, but that's my personal preference.\n\nI didn't get many smiles from the staff when ordering. Not sure if it was just too early for the crew, or if they were just too busy getting everything ready for later, but I feel that a lack of flashing pearly whites must be mentioned here.\n\nHot Sauce Williams has a multitude of delectable offerings. It's too bad I only had a short time to enjoy this experience. Hopefully I'll be back for more.","useful":1,"user_id":"oN23cWAm6Umyp19BTCc-QA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2010-08-29","funny":0,"review_id":"TxvtmRUirO4KzrgQ986yNA","stars":5,"text":"Driven past that ostentatious sign out front plenty of times but a little reluctant to stop and try their food. Should have definitely stopped by earlier.\n\n2 words: FRIED CHICKEN. Ridiculously good. The chicken looked like it had been sitting under the heating lamp a little too long but it was super crunchy and super juicy. I have no clue what they put in it but who cares.\n\nMashed potatoes were awesome. A little runny for my taste but delicious goodness. Cole slaw was good but a little too much sauce and not enough crunch. Definitely have to get back there when I get a chance. \n\nOrder cafeteria style and if you don't know what you want they'll be happy to help you out. Then grab a seat and enjoy your meal. Strangely enough they have a vending machine in the dining area so I guess it really is like a cafeteria.","useful":1,"user_id":"D_s41-7xCXqylWyJtQd7rg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":2,"date":"2011-01-16","funny":4,"review_id":"lfs2Jt-apvmE99QyoB3D6A","stars":5,"text":"It's a no-atmosphere soul food joint.  You're going to be lucky if the staff doesn't actively mock you before shoving the food across a sticky counter in your general direction.  \n\nThus, there is but one reason to come here: the food.  \n\nAs you can see from my quintuple-star review, that food is reason enough.  \n\nCleveland is superior to Detroit in many ways, but Detroit generally whups us when it comes to good, stick-to-your-ribs soul food.  Thankfully, this will do quite nicely.  \n\nThe fried chicken is amazing - a light, crispy crust that's so tasty you could strip it off and eat it on its own, the chicken cooked to a juicy perfection.  The ribs are a little tough - though that's a style issue, they make them that way on purpose because some folks like chewy ribs (I prefer fall-off-the-bone), and there's not a lot of bark on 'em.  \n\nFortunately, they will ask you at the counter: \"You want the sauce?\"  Hell yes you want the sauce,  Peppery without being blatantly hot, flavorful, why the hell did you come to HOT SAUCE WILLIAMS if you don't want the sauce?   Might as well go to Six Flags America and not buy a flag.  \n\nAnyway, the mac and cheese is soft but flavorful (no broiled crust, alas, which would bring it to perfection) and sticky with real cheese.  The mashed potatoes are saturated with butter, and a little chunky.  The candied yams are a little dry - I won't lie - but still nice enough to gobble through. \n\nAnd it's cheap.  $9.99 will get you enough to last you through lunch and dinner.  \n\nIf you're looking for haute cuisine, well, maybe the hideous pink building should have warned you off.  You come here as a food ninja - you sneak in, snatch the chicken from the master's hand, and get the hell out with a full belly.  It works.","useful":5,"user_id":"a1x5xhZ2zpBdOfqtH9x-Kg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-03-01","funny":0,"review_id":"Og0OGhKSOWU4Cv7_d35soQ","stars":5,"text":"This is hands down the best BBQ in all of Ohio, maybe even the best in the country (yes I know I need to eat it down in Memphis, Texas, and the Carolinas first to claim that.)  They have a thin sauce, which I like far more than the thick sauces, which is the most flavorful and succulent BBQ sauce I've ever had.  I have the Polish Boy which hit the spot.  They need to open a location downtown so it's easier to access and sees more traffic.  They would make far more money in a location like this too.","useful":0,"user_id":"oSDN3AAiog0OqQ9bS42_ng"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2010-06-30","funny":1,"review_id":"ljquRQzz3A0Js2g9cxZ8FQ","stars":5,"text":"As a Clevelander this place is legendary! The location on E.125 is the best in my opinion. Chicken, ribs, polish boys, okra, mac n cheese, and the sauce!!! It's all good!!","useful":0,"user_id":"Wl9Z0TiBgMd5cX_MYO_iPg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2015-06-25","funny":0,"review_id":"SCoPEM07G6uFw0ir4XtJHQ","stars":4,"text":"Best fried chicken I ever had. Went with 12 people and we ordered almost everything on the menu. None of us were disappointed. Well worth the stop. Collared greens were awsome ! Sauce was delicious","useful":0,"user_id":"0FuVzKxh4ydtzuJpnCRYiw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2016-04-20","funny":2,"review_id":"7CBzFYAQZhtClW1uS2bORg","stars":2,"text":"What a disappointment this place was. I heard from several locals, as well as great reviews online that this place was incredible.\n\nThis place is in the middle of the hood. Nothing wrong with that, but the place itself looked like a dilapidated shack. The building, parking lot, signage, doors, chairs, counters pace, everything was dirty, dingy and dank. \n\nOn top of that, THERE WAS NO ONE THERE! When I first pulled up, I though they were closed, there was one car in the lot and the lights were very low. For a place that has reached national levels of notoriety, I would expect it to have at least a few people there. \n\nThe service. Horrible. The girl at the counter was extremely disrespectful and had a stank attitude. I really debated walking out but since I had been excited for the food all day and drove for 25 mins to get it, I had already put in enough emotional investment to stick it out. \n\nLastly, the food. I'm from a place in NY state where \"Garbage Plates\" are a local food legend. The \"Polish Girl\" was Ohio's equivalent. It wasn't good. It was a just a mess of food. The collards, not good either. I wanted to try the potato salad, but they said it wasn't available. I didn't dare touch any of the other meats because they looked like they'd been sitting out for quite some time. The menu I read from was literally a white piece of paper that had crunchy bits and sauce all over it, from so many people touching it. \n\nWhat a disappointment this place was. Save your money and time. Don't bother to go.","useful":3,"user_id":"M7-K7GwC-vUUPVHfsv_xvQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2017-04-27","funny":0,"review_id":"Vp2rC99lrHmST-isbf5crw","stars":1,"text":"I'm so tired of this place not paying attention to simple instructions. I always order my food with light sauce and they always PILE it on.  I'm sorry but at some point I would really like to be able to actually taste my food.","useful":0,"user_id":"-HYNrx_v73c2Jr6dLBuhXw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-02-23","funny":0,"review_id":"jxEXpG_iIQNA6SVGvZSF-Q","stars":2,"text":"Not impressed ... I got the 3 piece chicken dinner with green beans and coleslaw. The coleslaw was cool? Green beans were bland, the chicken was cooked perfect very juicy and crispy but that's where it ends... I got the sauce because if the reviews... I'm still waiting to see what the fuss was about... Maybe it was the location, maybe the other locations are better. I will not be a return customer. I wish I would have gotten the po boy. Oh well I'll never know what it taste like because I just don't understand the hype.","useful":1,"user_id":"xqHK3H7shf-YMqXXjAHH8g"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-08-25","funny":1,"review_id":"h4foYWkCOnoBk40kwjVQfg","stars":1,"text":"I should have known this order would be wrong when I called and ordered wings and asked the young man who answered the phone \" how many sides cone with the wing dinner and he responded and said none.I told him your website says it conrs woth two sides...then he put me on hold and forgot I was on hold so I drove up to the drive Thur window.... Unprofessional!!!!!\nAt least learn your menu....","useful":1,"user_id":"9I2VX902vS4xH8daVWU2Ow"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":4,"date":"2014-07-26","funny":2,"review_id":"XA_jGbt7UU_AD2eTf63ZDw","stars":5,"text":"Impromptu trip to Cleveland that my boyfriend planned himself. First place he surprised me with was stopping here :). We had the polish boy hot dog- that was featured on man vs food. First let me point out that the polish girl is the hot dog featured on man vs food- although they call it a polish boy. ANYWAY... It was amazingggg. One all beef hog topped with coleslaw, their own tangy hot sauce with some BBQ flavors as well, fresh cut fries and pulled pork.... I didn't think I could eat the entire thing when I saw it- it was huge! But I loved it so much I engulfed it entirely! The sauce is the best. I had to actually go back in and get more sauce to go. \n\nTheir fried chicken looked incredible so I HAD to try it- I just ordered three wings in order to see how it was. The breading on the outside of the wings was incredible- they weren't too crunchy and almost tasted beer battered.. Amazing. \n\nWe had awesome customer service- everyone was helpful and friendly. \n\nI read some reviews and saw that some people were afraid to eat here and suggested drive thru... I guess that depends on when you go. I went on a Sunday afternoon, it was packed so we couldn't eat in the restaurant- but I would have gladly. There weren't any sketchy characters at all, everyone was friendly. There are sketchy people no matter where you go , so don't let any negative reviews like that turn you away from this place! I loved everything about it!","useful":5,"user_id":"DeXKbQYNx52OlOizobOLJw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-08-13","funny":0,"review_id":"FCy41HdsmvbUuODq9dtQGg","stars":4,"text":"I ate there recently when I was in Cleveland on a business trip.  I'm a \"food tourist\" and found out about HSW from Man vs Food.\n\nWhat I loved: the Polish Boy!!!!! OMG that was sooooo good.  The fries, coleslaw, and their unique bbq sauce just work with the polish sausage to create a one-of-a-kind taste treat sensation in your mouth!  It was so ridiculously good I talked some business colleagues into going back with me a few days later and they were pretty impressed.  One of them had the fried chicken (with their signature sauce on top) and he said it was damned good.  I also tried some of their ribs which were okay -- I was expecting better considering this is a bbq\/soul food joint but they weren't as tender as I expected.  That said, they weren't bad.  On my second trip, I tried the Polish Girl (which is the Polish Boy plus pulled pork on top of everything else); I was surprised but I preferred the Polish Boy over the Polish Girl. It's not that the pulled pork is bad --- it's great --- but it's one too many flavors in my mouth at once.  It wasn't bad but it just wasn't necessary.\n\nWhat was so-so: the decoration and atmosphere is that of a run down old restaurant.  That said....WHO CARES???  I come for the food, not the decorations.  You want decorations? Go to the Cheesecake Factory.  It's a dive but it's reasonably clean and it wasn't that bad.  The neighborhood isn't great but I went during the daytime (by bus, no less) and felt reasonably safe.  Nobody gave me the 'evil eye' even though it was pretty obvious I was \"not from around here.\"\n\nThe service: the people behind the counter weren't all smiles and energy but they got the job done and the food tasted good. Before going there, I read all the Yelp reviews and a lot of people are trashing the employees and their attitude.  Again, it's NOT the Cheesecake Factory with some chirpy employee who acts like your meal is their mission in life.  These people would probably rather be somewhere else.  But I wasn't ignored, they were reasonably courteous (again, it was VERY clear I was a tourist from out of town), and the food was prepared in a reasonable amount of time, done cleanly, and it tasted great.  If Cheesecake Factory level service is super important to you, you won't enjoy this place.\n\nIn short, come for the food, not the decorations and the service (which isn't that bad, just don't expect to be treated like a god).  If I ever have another trip to Cleveland, I am going to HSW again.\n\nPS They do sell the bbq sauce in bottles and I brought a few home to try and recreate the Polish Boy.","useful":0,"user_id":"wl2gOEQqgj_IJBzOHQoJXQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-12-20","funny":0,"review_id":"GQ3R80u-9gwcgbDhOcMnhQ","stars":1,"text":"Went a few months ago and was not impressed. We read many great reviews but we did not have the same experience. They were out of ribs and other items so we settled and the food was sloppy and not very tasty. We left and ended up finding something to eat.","useful":1,"user_id":"8nnVkTGbN9JyXvgnAWzfnQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2017-04-26","funny":0,"review_id":"k-zNFiaXmjGBLQ8WuzMaEg","stars":3,"text":"First off, yes this place is pretty ratchet and in a sketchy neighborhood. If you can get past that, its definitely worth a stop. I had the polish girl, with the pulled pork. The pork itself was kind of tasteless, the BBQ sauce kind of overpowered everything for me. The sauce was also a little too spicy for my liking, but not terrible. The mac and cheese was mediocre. There are other better dive restaurants here in cle for BBQ, but this place isn't terrible.","useful":0,"user_id":"Dppholn547PLAMkAG3YHyQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2008-12-31","funny":1,"review_id":"ziV0hcL44clZoCLF4g24pA","stars":5,"text":"Considering \"Gin\" or Aunt Gin as I call her since she is the sister of my grandfather (Beasley\/Williams) and is the owner of this restaurant, I have to give our family restaurant a perfect score. The sauce should be bottled its so good and one thing for sure, our quality of food has never changed since day one (see Whitmore's if you disagree). This restaurant is a pink building located in the \"hood\" of Cleveland, OH but no one gets \"gangsta\" around the Bar B Q...it's just not Kosher! I always loved their ribs. No games, lots of meat and plenty of sauce with little attitude about it! Prices are general $7 - $10 dinners, $6 - $8 sandwich meals. Cleveland is the only city that serves barbeque fries which is when they take deep fried French fries and drench them in barbeque sauce....ummmm good!\n\nHot Sauce Williams is the best, but then again anything produced by my family I will deem as the best.                                 \n   ***Buyer beware of the \"Itis\" ***","useful":1,"user_id":"mR27DvUhfuzgZ8sCnu6XIQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-08-01","funny":0,"review_id":"nWT9qXIBOmVqX4_pFJQVSQ","stars":3,"text":"I love their fried chicken with their house made hot sauce on it. It is the epitome of southern fried chicken. The coleslaw is great and creamy. Fries are your standard crinkle cut fries but great to dip in their sauce.  I am also a fan of the polish girl and polish boy (Cleveland staple). I like the sauce but their ribs are a little fatty and not meaty, therefore I personally don't order the ribs. So that is the food. Now the atmosphere is not that great but you can't expect a fancy atmosphere and as long as you know what to expect in the neighborhood then you are fine. Now the service is another story. Expect an attitude, rude servers and someone who is just downright annoyed that you are bothering them by making them have to work by preparing your order.   They also run out of food and no matter what time it is they won't be making any more because once again it's too much work. I therefore have to call to make sure they have certain types of  food like chicken breasts before I come as I live 30 minutes away and can't tell you how many times I made the drive and was told they are out of white meat and don't plan to make anymore. They also close early if they don't feel like being open anymore. I actually had them turn the lights and drive through system off on me when I drive up an hour or two before their official closing time. So to sum up, the food is great, service is horrible so if you go in expecting someone to not like you to get some great BBQ then you will be happy.","useful":0,"user_id":"5RLOLqj8f0MMJ5OJVXTeYQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2016-09-01","funny":0,"review_id":"ZMAKZXxFB0RUjlRbxjaFyA","stars":1,"text":"When I moved here from KC I was excited to find some great local BBQ so I starting asking everyone I met where their favorite was ... This place was mentioned by multiples so I thought it would be the first I tried.... Sooooo disappointing ... Looks like a dump outside but that's never stopped good BBQ before ....Food is sitting in hot plates\/warmers under a cafeteria style covering sitting there for who knows how long ... As unappetizing as this was I went for it and wished I hadn't ... Served in to-go containers absolutely drenched in sauce (mind you I like sauce as a KCer) but it was soggy, and not in the fall of the bone type of way .... Wtf were there so many photos of famous peeps on the walls for??? I would never go back here.  I get CLE isn't known for BBQ but how is this known as their best? I feel sorry for everyone that has no idea what they are missing out on .... Let it b known I've had amazing BBQ in Texas, Oklahoma, Memphis, Chicago ... I'm bias to KC but crap is crap and this was crap.","useful":0,"user_id":"3Hud9hTH36DB5MeDOihjnA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2011-03-12","funny":0,"review_id":"fB0uq_1gU213eFTbtheYSQ","stars":3,"text":"The Rib Dog sandwich was an interesting dish that consisted of two of the juiciest, best tasting ribs I've ever eaten wedged between two hot dog buns.  The sides were a slaw that wasn't two wet which sat well since the fries and ribs were drizzled with the establishment's famous sauce.  The sauce was zesty but not too spicy.  Having grown up eating barbecue in South Carolina, Hot Sauce Williams is a place that can scratch my itch.","useful":0,"user_id":"TPDTu3KAJ-RCbHiaraBeDg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2012-06-06","funny":0,"review_id":"Tt3IK5k3sPJrOU_9VBjH8w","stars":4,"text":"I've driven past this place who knows how many times and between that sparking my curiosity, along with my bf taking about how good it is, I figured one of these days I need to give this place a go. Well, that go happened recently after moving the first batch of boxes into our new place.  Between carrying heavy boxes up a steep, long flight of stairs and just plain sweating off calories standing in the heat (gross, i know.  Sorry), I figured I would treat myself to this messy, greasy deliciousness.  And now I'm glad I did. \n\nWhen we walked inside and I looked at the menu for the first time, I was a little overwhelmed - mainly because everything looked so good and I couldn't make up my mind on what to order.  But in all seriousness, they have quite a few combination platters to choose from, so ordering may take some time.  I settled on the fish, shrimp, and fry combo - the boyfriend went for the chicken, rib, fry combo.  Both were excellent choices.  Be sure to work on those biceps before you come here because the boxes of food they give you weigh a ton!  You get a massive amount of food for a great price, everything came out fresh and hot, and the sauce they pour over everything is AMAZING.  I was an overly stuffed\/sauce all over face girl when we left, but it was absolutely worth it.  So don't wait as long as I did to get your grub on with some excellent BBQ because you need to know what you're missing out on.\n\nOh - and FYI - don't wear anything nice or white to this place.  And if you have young children you might want to borrow one of their bibs because the eating is quite messy.","useful":1,"user_id":"RvaNCv4vdJEkBfNIWqxV5Q"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2011-04-13","funny":1,"review_id":"i8qaR4BYNgRByAbX_E0cQQ","stars":4,"text":"Without a single doubt the absolute best fried chicken I have ever had. Ribs were good but not crazy noteworthy or anything. Historic Cleveland establishment. Go here.","useful":1,"user_id":"n0DjR5Jb-dU4WkgzIe313g"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2016-06-30","funny":0,"review_id":"o2Q-VrCCYUarID01OaWhLQ","stars":4,"text":"First time going there. A little slow but worth the wait. We got a Polish boy and girl (intrigued by the addition of pulled pork on the girl). Truth be told, we didn't want to eat in so we got it to go since it was not super clean but most because there is no air conditioning on.  The guy in front of us ordered a slab of ribs which is ALOT of meat but said he was working down the road and had never been there. In fact, most of the conversations I heard was that of ppl eating there for the first time. The sauce is the real deal and will definitely go back to try the fried chicken. BTW, the cost of our boy and girl was less than $12.  It's worth it.","useful":0,"user_id":"JuFBjJWirUwqnnyD4U_HlA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2016-11-21","funny":0,"review_id":"YNztGLffV03qW7FPGO73nA","stars":5,"text":"HSW is the best.    Best fried chicken north of the Mason\/Dixon. I have enjoyed HSW many times over the years.   Tried the ribs for the first time, delicious.   Great food, will be back again and again and again.  Thank you HSW for offering this fine food in the Cleveland area.","useful":0,"user_id":"sE8U8Y1XfbFEsHdIeoxMbg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2012-09-15","funny":0,"review_id":"3U8uttaedEVp2xPrS44jdQ","stars":3,"text":"Superb chicken with service that is a little on the slow side.  Hot Sauce Williams has very good fried chicken.  The pieces are huge and very crispy.  You can have the restaurant's famous barbecue sauce on the side or served on the chicken - personally I like the chicken better without the sauce on it.\n\nThe ribs are decent, but in my opinion the chicken is the winner here.  The only reason I didn't give this place 4 stars was that it took quite a while (more than 30 minutes) for me to get my chicken both of the times I came here.  While I appreciated how fresh the chicken was, I thought that the new batches of food could have come out more quickly.  Also, the serving could have been more efficient.  When I have time to wait though and want to buy a large tray of fried chicken for a party, this will be the place that I will be going to.","useful":2,"user_id":"ITSnuLOu81doC5GGT5NMSQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2012-12-28","funny":0,"review_id":"bmWvWPcYX8SR57OXGqTaDQ","stars":2,"text":"I'd like to give them more stars but let's focus on the obvious:\n\nThe mac and cheese: Tasted like someone left it out under the heat lamp to the point it was fermenting. A very sweet taste to it...like it was off.\n\nThe chicken: It was ok and all but nothing special.\n\nThe Po Boy: It was good. Just nothing special really....meaning it doesn't take an iron chef or a recipe to be passed down to make that right.\n\nFries: Meh\n\nSauce: Really good but on rather bland and dry food, its just ok. \n\nAtmosphere: Ghetto and cold (temperature and vibe). \n\nI would like to give them another shot, but, at best, that just means they are inconsistent if I like it next time......","useful":3,"user_id":"-HLE-x7Lpkfprd6er-JFGg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-07-01","funny":0,"review_id":"5ZYstt5wB-8VpcX7E1vseg","stars":2,"text":"Omg!  I have been eating there of and on for years and the quality has just gone down.  I don't know why but the meat seems to be of lower quality and poor cut.  The service is no longer stellar as it used to be.  I ordered a simple rib dinner and the ribs were stringy and tough and the fries were mush.  I dont like to give poor ratings but this is just not the level of service that I know hot sauce used to give and it needs to be rectified.","useful":0,"user_id":"5r2oH1YoLCY2wv3dPuwv_w"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2014-10-12","funny":0,"review_id":"0QPv5Zdxuws3NnGaCOZcxg","stars":3,"text":"Came to Cleveland and just had to try a Polish boy- but it was Saturday so Seti's wasn't open. Decided Hot Sauce Williams would be a decent alternative given the circumstances. All I ordered was one Polish boy for $5.25 from a not too friendly set of workers and was given my order in 2-3 minutes. \n\nThe first thing I noticed was that this could not be eaten by hand. I picked up the dog and the bun immediately fell apart from being drenched in sauce. I managed to get a bite of all the flavors and they mixed fairly well but nothing special. The hot dog had good beef flavor but tasted like it had been sitting around for awhile. The fries were regular crinkle fries like you get in an Ore-Ida bag and the coleslaw had a strong mayonnaise taste, but I really liked the hot barbecue sauce put on the dog. Overall despite not being assembled of the greatest ingredients I think the polish boy was better than the sum of its parts and actually tasted pretty good when you were able to get a bite of all the elements.","useful":1,"user_id":"aLqp_fe64ugZFuwMpsXLiw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2011-09-05","funny":0,"review_id":"Xm_tNt_uKHsW1VL-5kERwg","stars":5,"text":"Fried chicken was great, awesome with the BBQ sauce!  Picked up a few bottles to take home. Can't wait to try them out.","useful":0,"user_id":"T5lSSewzKc7pEPXFc77D7w"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2008-11-28","funny":2,"review_id":"8HI-67QCxl0C7etOfymVQQ","stars":1,"text":"Gut rot. 1\/4 meat, 1\/4 fat, 1\/2 sauce, that pretty much sums up the ribs at HSW. Not the cleanest place I've ever been. It's not good...at all. Yech!","useful":2,"user_id":"r1jWEEScNKa-Xiw1Lad-rA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":3,"date":"2010-07-12","funny":0,"review_id":"taZXRKDsFvhSzuJ5QjDj0Q","stars":5,"text":"I'm giving them 5 stars for the fried chicken alone. It is amazing. It has this super crunchy crust that is totally unlike anything I've ever had on fried chicken before. It's like having your chicken thoroughly egg-battered and then friend crispy. The result is positively delicious. \n\nI love the ribs too. They don't boil their ribs before cooking them, so if you like 'fall off the bone' type ribs, these are not for you. These are good ribs to knaw on. They were also impressively big.\n\nI almost docked them a star for borderline surly service and lack of A\/C, but at this price ($30 for four people +leftovers) I can hardly complain. They'll have to be much grouchier than that to keep me away from that fried chicken.\n\nThings that were great:\n+Mac n cheese\n+Fried chicken\n+Sausage \n+BBQ sauce\n\nThings that were not great:\n-Not terribly friendly (to us)\n-No diet in the soda machine\n-Greens were only so so\n-The sausage ends up too soaked in slaw and bbq sauce to actually eat with your hands. The bun will just fall apart.\n-Zero ambiance. They could use the services of a carpenter and a painter.\n\nFinal note: this review is for the pink location on Carnegie and does not apply to the Lee Rd location, which was only mediocre IMHO.","useful":4,"user_id":"Xw4t5H88wVt6vfKw3n3z-Q"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2014-08-14","funny":0,"review_id":"4qRc8ybyNuWrtpSaLrtYgQ","stars":2,"text":"Stopped by hotsauce williams for some takeout today after my hubby's cleveland clinic appt. Read all the hype & was so excited to try it. The drive thru speaker doesn't work & you can vaguely read the menu. They were out of cod. So I ordered a tilapia sandwich(5.50), combo 2chicken & 2ribs w\/ coleslaw & macaroni & cheese (12). My hubby got the polish boy(5.25). Well overall we were DISAPPOINTED! The polish boy was SUPER SALTY & the frozen crinkle fries they slapped on top were a soggy mess! My tilapia sandwich was a paper thin breaded piece of fish w\/ 2 mashed pieces of white bread on side. So, I put the fish on a bun w\/ tartar & a piece of lettuce. It was good. DON'T ORDER THE MAC & CHEESE! It's almost inedible (reference picture). Slaw was warm & kind of soupy, but had flavor. THE RIBS ARE THE ONLY THING I CAN SAY ARE WORTH IT. Pretty meaty, slight char, pretty tender (meat wasn't falling off bone though), & the sauce was a nice balance of sweet & spicy. The fried chicken was decent. Essentially I paid $22 for 2 ribs because that's the only thing I was truly satisfied with. I won't be giving them a 2nd chance sadly...","useful":3,"user_id":"3tFW6x0PaEIiokZTjKAVqw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-08-15","funny":0,"review_id":"UJxPEFOJGzS0HI10zNtq2Q","stars":4,"text":"4 1\/2 stars for food. DELICIOUS fried chicken, beans, and pork ribs. And I mean, delicious. Wow. Did not expect that out of a place looking like HSW. Got a smoker in the back, and with the looks of smoke rings on the ribs, you know they're doing it right.ac and cheese was ok, polish boy was good, and so was the fried okra. Will be back for sure.","useful":0,"user_id":"DxsZCsQXTN7vcVUwtGlN9g"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2014-10-27","funny":1,"review_id":"TJVXia7aAZnwYEjfVqC4Ww","stars":2,"text":"I'm not gonna say that I hated it...but, it was close.\n\nMy husband and I were I Cleveland to see the Raiders play the Browns. We decided to eat at this restaurant, seeing that we love man vs. food and Adam seems like he has good taste. \n\nWe pulled up, and the outside of the building was old...like really old. But, we're from a small town, and we know some of the best food is served in the strangest places. So, we decided to give it a shot. We walked in...and it was a pink explosion. They had everything from pink walls, to pink tablecloths.\n\nEven after that, we thought...\"Okay, we can get past decor'. We're not fancy people, we just want some really good food.\" We were hoping that the food\/service would make up for the atmosphere. However, we didn't even think we would ever revive food, considering that we sat for 25 minutes before our order was even taken.\n\nWhen our waitress FINALLY got done checking on all her 3 other tables, cleaning, stocking, checking the kitchen, and anything else she could think of, we finally placed our order. Which was a miracle seeing that the menus were hard to read. By that time, two MASSIVE (I'm talking aunts, cousins, kids, grandma, the works)families walked in. \n\nInstead of turning people away, politely explaining that there was no room to seat them, they let them stand in the dining room, waiting for seats. We literally had people crowded around our table standing...it was severely uncomfortable. Not to mention the noise level with all of those people in the same small space.\n\nWhen our food got to our table, it was good. It was VERY good. My husband loved the ribs, and my chicken was to die for. However, it was wasted on the atmosphere. There was no possible way they could have made food good enough (delicious as it was) to make up for the time, energy, and experience we had. We both left with a headache. \n\nIf you want some good food, you can find it there. But, you're gonna want to call in a carry-out order.","useful":0,"user_id":"Jg9fKTfrDwq3jktc6A83sA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-07-19","funny":0,"review_id":"RldEiod8LZ4BhGZZKHpn7A","stars":4,"text":"The chicken was good, not the greatest in the world but definitely in the top 5. The chicken was crispy, moist, and it had a tangy-Chinese chicken like taste. \n\nRibs were ribs, not bad, not amazing. Candied yams and collard greens, same deal.\n\nAlso had the Polish Boy, probably will never eat that again. Not because it tasted bad (it was better than I expected), but because it was just too much soul all in one package (fries, sauce, and very creamy cole slaw slabbed onto a beef dog). \n\nAll in all, if I were to do it again I would just get the chicken wings, sauce on the side.","useful":0,"user_id":"ZAvOJe6YZ6ap8gCgBPh4Rg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2011-09-13","funny":1,"review_id":"aB_Vn2hrgaYO_ee7pip1Gw","stars":4,"text":"I love dives and this has it all: mauve and sea green walls and electric pink trim complete with what appears to be an empty domestic entertainment center. In the back is a smoker that looks like it's been converted from a WWII tank. The patron who was taking to everyone like he was on speed (but apparently wasn't because he was chowing) felt the need to tell everyone \"it's all about the sauce, any moron can fry chicken, I can fey chicken, this place is all about the sauce.\"\n\nI ordered the rib and chicken dinner with fries and coleslaw. They asked me if I wanted sauce on everything and I got the sense  that, that was the thing to do, so I did. While the sauce is quite tasty, it's way on the sweet side. Definitely overkill having my fries swim in it. Next time I will opt for the black-eye peas. The chicken had a nice crunch and the sauce went well with it's greasiness and the ribs were fall off the bone good.\n\nIt receives high marks for being one of the messiest meals I've ever eaten.","useful":0,"user_id":"DGwncjO0h6WiBw5nsPDuZw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2011-07-07","funny":1,"review_id":"g6NaySD-OvUHUKM1SzMuOw","stars":4,"text":"Coming here, I had high expectations for this place.  Then I decided to drive by, and I realized that there was a chance I could get shot, despite only being 1\/4 mile from the safe haven of the Cleveland Clinic.\n\nPart of this place's success is its proximity to the Cleveland Clinic.  They have a section of the front wall dedicated to when Robin Williams visited after getting heart surgery in 2009.  Next to his frames on the wall are those of Adam Richman, whose visit made this place a nationally-known restaurant.\n\nThe floor of this place is filthy.  There are some places where you could probably eat off of the floor; however, you could probably catch a really bad disease doing so here.  The tables weren't much better, either.\n\nNow, to talk about why this place is famous:  their food.  They're best known for their fried chicken and their Polish Boys.  I opted for the Polish Boy, and asked them to put their hot sauce on it.  The Polish Boy is essential a hot dog covered with cole slaw and fries, as well as cayenne pepper seasoning.  The slaw and dog went well together, and were actually complemented by the cayenne pepper seasoning.  However, I thought the fries were a little too soggy for my liking and the hot sauce actually took away from the overall taste of the sandwich by dominating it.\n\nIf you opt to not add any hot sauce, this should be one of the best Polish Boys you can find anywhere.  Stefanie C. mentioned that their fried chicken is A-MAZ-ING, but I was unable to try it.  If you are in the area on either Euclid, Carnegie, or Chester, you definitely need to stop by.","useful":3,"user_id":"hHOsJjdR1R4rzB08Divfvw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":7,"date":"2010-06-02","funny":10,"review_id":"1GDZm84edgNab58aZeqr3g","stars":4,"text":"You've probably driven past their hideously ugly pink and blue building hundreds of times and have never stopped in. Well, you should remedy that. \n\nI'm not big on this type of food at all. I would never in a million years order ribs because I don't like to get barbecue sauce on my face. I like healthier more inventive food, snobbier food maybe? But damn, Hot Sauce Williams is good. KFC or whoever has NO business using \"finger lickin' good\" -- I think HSW should steal it. \n\nMy family was all about going to the rib cook-off yesterday. When it started to pour nobody wanted to go anymore. Hot Sauce Williams was our next choice. We were very happy that it rained. \n\nI ordered the fried chicken and rib dinner. I couldn't NOT have ribs at HSW. It came with 2 sides. I chose collard greens (of course) and cole slaw. My brother and I also split a pork shoulder sandwich (cuz we're fatties). Yep, the one that was featured on No Reservations. Everything was very tasty. The fried chicken was the best I'd ever had. I can't say I've actually eaten that type of fried chicken many places before but it was so effing good that I wanted to make out with it. \n\nMy only complaint with HSW was the girl working the register. She could have been more polite, maybe even a tiny bit personable, or perhaps ... I dunno....helpful? and not a complete bitch? We were almost afraid of her. \n\nI'll be back for sure. I just hope the Trunchbull isn't working.","useful":9,"user_id":"WL_U3MBUfTkeHL9lYxoleg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2009-07-22","funny":0,"review_id":"3DMEKYMxeUv8WArCk0AWMw","stars":3,"text":"I have to admit that I am not one to line-up to sample any food described as \"spicy\" or \"hot.\" Luckily, Hot Sauce Williams signature bbq sauce is not spicy as the name originally suggested to me.  I had the ribs, coleslaw, and french fries, all drizzled with the mild bbq sauce. As you might expect, this was a generous portion of smoky ribs and I did not even come close to finishing the meal. This was fine with me, because now I have leftovers for lunch! The rib dinner, combined with a Pepsi, totaled approximately $10. My friend purchased the chicken dinner (fried chicken) with mac and chees subbed for the coleslaw. Substitutions are a slight up-charge, but it seems worth it to me for home-style mac and cheese. She chose to have her bbq on the side. You must request this, otherwise that ladle of sauce drops on the fries and all. The three of our meals totaled around $30, and if I could make one suggestion to anyone reading this, it would be to try the \"family meal\" which seems to include an insane amount of food (I guess enough to feed a family) at only $28. It is probably a good thing that the 3 of us chose not to share the \"family meal\" as I don't think any of us need that much mac and cheese, ribs, and fried chicken! I was going to suggest that anyone thinking of ordering food for the first time visit the Hot Sauce Williams website but as I write this entry, their website does not seem to be active. Ordering may be a little confusing for a first time customer stepping up to the register as their menu is not clearly visible. However, if you come armed with the information I have given you, you should be all set. Get the family meal if you are ordering for a group ($28? Why not!). And if it is just for you, try the chicken dinner, coleslaw, and mac and cheese (slight up charge for the mac and cheese) with sauce on the side for approximately $10. Enjoy!","useful":2,"user_id":"H_-K6erSJYtzg3ZEvOg3EQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":2,"date":"2009-07-21","funny":3,"review_id":"-RSIdXxdGhuygvOrozJvdA","stars":3,"text":"Hey now...this is good BBQ...for Cleveland!  It's definitely a down-and-dirty BBQ joint.  The interior is pink and blue--not exactly the most appetizing colors.  If they bother you that much, there's always the drive-thru.  When you walk in you tell the lady at the counter what you want (from the single sheet of paper on the counter that shows the menu).  She takes your money, and then you pick up your food at the other end of the counter.  It's kinda like a school cafeteria--food is under hot lamps and kept hot in foodservice trays.  Just about every booth in the restaurant has ripped and patched \"pleather.\"  Classic.  Service is very sllloooowwwww.  \n\nI had the pulled pork sandwich--tender pork nestled in between 2 slices of white Wonder bread and topped with a slathering of Williams' own bbq sauce and coleslaw.  And I got a small side of macaroni and cheese.  Both were very tasty.  We also got some fried chicken and that was damn good.","useful":3,"user_id":"Xxvz5g67eaCr3emnkY5M6w"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2013-10-11","funny":1,"review_id":"kpEcxYtn4L_oUBBa-vfnqg","stars":5,"text":"The first time I had hot sauce Williams I didn't understand the sizes. So between 3 people we ordered like $40 worth of chicken on our way from cleveland to Columbus. By the time we got there, all the chicken was gone. I have never eaten a tastier chicken in my life","useful":0,"user_id":"DpzkYEYIKnAMg9-gWIsCZg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2008-08-03","funny":1,"review_id":"gwf8D_tR8gZWipf4Xz_lEg","stars":4,"text":"I enjoyed the fried chicken and found the ribs to be rather tasty. I love soul food!","useful":0,"user_id":"3Uv0dGI2IXJb2OUj8R2GJA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2011-01-16","funny":0,"review_id":"uAX5M4LOX3ToEMBVWau81w","stars":5,"text":"We've driven past Hot Sauce Williams any number of times, always on our way to some other event, always promising that we'd stop \"next time.\"\n\nWell \"next time\" finally arrived. And we are kicking ourselves for taking so long. The fried chicken was the best I've ever eaten - juicy and tender on the inside, crispy on the outside. The ribs were tasty, as was the sauce. The macaroni and cheese is only beaten by the memory of mac-and-cheese from a sadly defunct soul food restaurant (it was so good we called it \"crack-aroni and cheese\"). The yams and baked beans were also excellent.\n\nThe restaurant is counter service, with a spacious, beaten-up dining room. Considering that the dining rooms in the soul food restaurants where we ate in Atlanta consisted of picnic tables and benches, the decor seems fitting. The service was perfunctory, but not rude. \n\nIn sum, delicious food that's SO bad for you - definitely not daily fare, but the choice for soul food here in Cleveland.","useful":1,"user_id":"aW2GmH0UZPvjpex1abJFvw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":4,"date":"2015-05-12","funny":1,"review_id":"T9lcB8QgOMU7p2sFPOFrdQ","stars":5,"text":"This place was pretty awesome, it is in a pretty bad neighborhood and the dinning area isn't the most up to date. But the food definitely saves the day. If you are looking for a mounted menu, you won't find one. They have a paper menu on the front counter that has seen better days. The prices aren't bad and the selection is your standard, when it comes to a soul food spot. I ordered the 2 piece fried chicken meal, with sauce on the side (because I'm not the biggest fan of spicy). The chicken almost feels as though it was made tempura style, the crunch is very different but very good at the same time. The fries are your traditional crinkled cut, no standout seasonings were detected. I am not a fan of cole slaw so I donated mine to the trash can (seeing as though you cannot substitute sides). When I asked how much the can sodas were, the cashier replied \"man these suckers are expensive $1.50 a can.\" Being that I am a punk when it comes to spicy foods I had to purchase one. I was pleased to learn that the sauce isn't all that spicy and I could tolerate it with the help of the expensive soda. I will definitely be back the next time I'm in Cleveland. Fried Chicken 1-5=5. Fries 1-5=3. Sauce 1-5=4.","useful":3,"user_id":"7DCwwpe524F2AqZqTUGExg"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2013-11-26","funny":1,"review_id":"UbxtfS2U51jeVQ3HklkTgQ","stars":3,"text":"I waited for so long to try this place, and completely hyped it up for myself. I had only heard good things, and had imagined the best BBQ and fried chicken of my life, with comfort food abound!\n\nSadly, it did not live up to my hopes. We went through the drive through. I got the polish boy, which was admittedly pretty good. But their mac and cheese was abysmal. It was plain noodles with cold cheese on top of it, not saucey at all. I am unashamed to say that I eat a TON of mac and cheese, and I couldn't eat this at all. \n\nI am willing to try it again. I think I'll opt for the fried chicken next time. Here's hoping it's better next time!","useful":1,"user_id":"DOKrvb9i0A3a-CpOxLqo4g"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2014-04-07","funny":0,"review_id":"LnQZygdVMgAIQ8KSuQCXWQ","stars":5,"text":"Although the outside is a little scary the food is to die for. I ordered the family meal and it was absolutely amazing!!!!! The fried chicken with the sauce poured on top was enough to satisfy even the bigger BBQ fanatic the ribs were amazing and the Mac n cheese is baked and very good as well. One of those places you'll become a regular.","useful":1,"user_id":"1yEGaYQ1x4qDN8hDZ59Tkw"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":1,"date":"2017-03-18","funny":1,"review_id":"HNFFq2aCTzcqyipdWeMsow","stars":4,"text":"I've never had anything here other than the fried chicken but the fried chicken is great. Good price, too. It comes with a \"hot sauce\" that really is more tomato based than spicy. The building\/location is kind of tacky\/ratchet.","useful":1,"user_id":"8SVOBWdAtEdZ23y-AkOUQQ"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":0,"date":"2015-11-20","funny":1,"review_id":"96-QirYGNfKEpp-k8TjAPQ","stars":2,"text":"I'm not sure what to do with this place... A couple of my friends took me here; they said they come here every now and then and enjoy it. But...\n\nwhen they took my friend and I, I was a little less than underwhelmed. We were the only four people in the place (except for one guy who came in and tried to sell us pirated DVDs) and I was the last to order, but by the time my catfish dinner arrived everyone else had already finished their food. It took them almost 25 minutes to make my food. So for 25 minutes I had a good long look at their heat lamps. I watched several flies and fruit flies land, fly around, and then re-land on the coleslaw and fries. Needlessness when my food actually did come up, I was in no hurry to eat either of those two sides I had gotten. I will admit that the catfish itself was tasty, but the atmosphere completely took my appetite away. The one garbage can in the dining area was overflowing with food bits and dozens of fruit flies, so when we decided to leave (about 5 minutes after my food came), I had to take mine to go, but then my friends had to just set their garbage next to the overflowing trashcan because there were no employees in sight. Also, the parking lot and surrounding area was super sketchy. If the catfish hadn't have tasted alright, this place would have only gotten one star.","useful":3,"user_id":"zvoKQvcCsnJeC7ZRKrsWPA"}
{"business_id":"tulUhFYMvBkYHsjmn30A9w","cool":3,"date":"2016-03-09","funny":1,"review_id":"P_tZHBBAIi-T9m66fFGtfw","stars":3,"text":"My friend and I were talking about this place and we decided to get a quick take out order for lunch.  He hadn't been here in years and I haven't been here ever so we headed out.  I was curious because it was on Man vs. Food and if Adam liked why shouldn't I?  Inside the restaurant I saw pictures of celebrities that have visited which included Samuel L. Jackson, Robin Williams and other celebs hanging on the walls. \n\nI tried the po'boy and chicken\/rib dinner.  The BBQ sauce was tasty with initial sweet and then hot tones, slightly delayed.  As you get more into the meal the heat starts to build up.  It was good and probably the best part of it all.  The same sauce was used on basically everything that is served there.  \n\nThe po'boy was a mess so I used knife and fork to eat this.  The sausage reminded me of polish kielbasi which had snap and nice flavor.  You either like it or not and for me there was a lot going on.  You have french fries, BBQ sauce and coleslaw happening at once. Have a flexible pallet if haven't had this before.  I thought this was good.\n\nThe ribs were okay, maybe on the tough side  Did we get leftovers from the day before?  As we were leaving, we didn't see the smoker in use at the back part of the parking lot. The chicken was tasty and was slathered with the same sauce.","useful":2,"user_id":"yQN0tGkqhi0Ch0Hqdj2XSg"}
{"business_id":"3pP9r63a9lj_fisWpPfsjw","cool":0,"date":"2015-06-09","funny":1,"review_id":"KiqTLrB8jPrMfY1vV1I7dg","stars":5,"text":"I had a great experience at this Target recently.  I shop at various Targets and this location had a decent amount of product compared to other stores where they must not have enough space.  I got some good deals on clearance!  And the staff were efficient and friendly.","useful":0,"user_id":"Z0sXnwF1eZWONpRzMedOEQ"}
{"business_id":"3pP9r63a9lj_fisWpPfsjw","cool":0,"date":"2017-01-05","funny":0,"review_id":"XG-djl9-2NlTlCso4XOwUg","stars":1,"text":"I've shopped at many Target stores, all of them pretty decent. But this store has one of the most poorly trained guest service departments.  The phone operators sometimes disconnect callers (unintentional I'm sure), In person, simple questions or inquiries seem to stump this crew and the frustration or anger they feel is uncomfortable.  Don't know if they are poorly trained, stressed out for personal or professional reasons, but there is a negative bully vibe.  I try to avoid this store unless there is something the other Targets run out of. The management needs some rigor and training, they appear clueless as well.  Put the older, gentler, know how to talk to customers, employees working the check out lines in Customer Service, and put the Customer Service bullies in the check out areas where they will have minimal interaction with guests, just a simple suggestion that might help a lot. The locals deserve better treatment, it can't be that stressful working in a Target store.  Have even encountered crazy types in the parking lot; makes me wonder if this one was built on a sacred burial ground or something?","useful":0,"user_id":"UGlJYHK0I7TM6yLB3Rkp2w"}
{"business_id":"3pP9r63a9lj_fisWpPfsjw","cool":3,"date":"2016-10-06","funny":3,"review_id":"0_pgo3UjoPTnsyJlbvs3ag","stars":5,"text":"Just like any target stores you go to... it's clean, the staff is very very friendly and helpful, and it's organized! This target also has a grocery section in it, so you can go shopping for majority of your every day essentials!  And of course there's a Starbucks and some finger food you can buy in the front so you don't go shopping hangry!! Enjoy!","useful":2,"user_id":"DIqmYwkcPFcYnEpWvzXeOQ"}
{"business_id":"3pP9r63a9lj_fisWpPfsjw","cool":0,"date":"2016-04-09","funny":0,"review_id":"WM_lWIBZtL4zuSsnTKdPRQ","stars":4,"text":"This target is the cleanest and most efficient one in Greater Cleveland.  Always good customer service, which for whatever reason is a lost art these days.  They also have expanded and added a great food section here as well. If you look hard enough you can find some great deals on clearance items throughout the store.","useful":0,"user_id":"yRKigT6QljbO--QYjOX1xw"}
{"business_id":"3pP9r63a9lj_fisWpPfsjw","cool":0,"date":"2016-05-23","funny":1,"review_id":"ezz6bnjTeM9OiRjUQwUKNw","stars":4,"text":"My home location. About a 3 minute drive away. Obvious opposite from the Walmart in the area. Shelves are always stocked. Staff is always friendly, displays never disappoint. The only negative I can say is that they never have newer children's clothes, which I usually tend tl run in for for my younger son. Beside this, I can't speak negatively about them.","useful":1,"user_id":"ypKZT3cHMUKv15JfKmxnkQ"}
{"business_id":"3pP9r63a9lj_fisWpPfsjw","cool":0,"date":"2010-02-14","funny":1,"review_id":"xUJsSVYk07Y0oAU4IJW5kA","stars":4,"text":"This is an extremely nice place to shop. The only reason it doesn't get five stars is the following reason: the stocking in the frozen foods section hovers between sketchy and downright schizophrenic. For instance, having a trillion pepperoni pizzas and having one in stock with just cheese. It's really inconsistent, to the point that I've left the frozen foods section empty handed because the items I wanted weren't there that week. \n\nHowever, the customer service and quality is still outstanding. The cashiers and associates are unusually helpful and polite, and to me that's one of the biggest things that influence my shopping decision.\n\nAll Target needs to do is fix some of the stocking issues, and this will easily be a five-star store. I'd rate it 4.5 stars if I could.","useful":1,"user_id":"_yk1budTwbz5YrqHO4DOeg"}
{"business_id":"3pP9r63a9lj_fisWpPfsjw","cool":0,"date":"2017-04-19","funny":0,"review_id":"ZCWTfbWKqn5UpeKopFn7uA","stars":5,"text":"super clean store and the employees were really helpful. The cashier introduced me and helped understand the cartwheel app. I am 100% more likely to come back because of her!","useful":0,"user_id":"A2MW0tG9CAWI6MMEWAvE-g"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2012-04-22","funny":0,"review_id":"KtHScmpd2vDKinO1LV4afA","stars":1,"text":"We decided to grab a quick meal before heading off to the nearby airport. But I felt the place wasn't the cleanliest and our waitress smelled of bad BO, that was very noticeable and distracting. We ordered some omelettes and hash browns and it was quite lacking in flavor. I know it's a chain, but I've seen much better.","useful":1,"user_id":"cHgsx8nhRdzSDvyleihkmg"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2014-10-07","funny":0,"review_id":"CS2HWwJyBUCzfmXh6WsD5w","stars":5,"text":"Every time my husband, kids & I go to Cleveland to visit my husband's family we come here.  The food is great and service is wonderful.","useful":0,"user_id":"Ozk5VXvLLhjSrQ5hV8MjFQ"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2014-07-28","funny":0,"review_id":"nnpYNP3KvX6KhcdGQRgW9Q","stars":4,"text":"Did the quality go after 3 years?\n\nThe last time I went to that location was 2011...I was a chaperone for a church youth group. I didn't know what I had, but it was edible, I went there more than 20 years ago (same Denny's) and it was okay.\n\nAnother franchise that I'd like to put in my film \"Summer I'll Never Forget\".","useful":0,"user_id":"c1BpiSp3XAqFLG1LuN2DdA"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2016-10-21","funny":0,"review_id":"mYd0v_SeFDd0hF9PA675rw","stars":3,"text":"Three stars given here because the staff did a great job with my party of eight but only giving two stars for cleanliness and the food.  \n\nWhy is it that you can't go to a Denny's anywhere and not have some kind of problem either with the wait staff, hostess, cleanliness or food? I don't know why but I always walk in expecting something to go wrong.  That's horrible isn't it? You might wonder why I even go to Denny's? Well, let me answer that question... I usually patron Denny's for breakfast, usually while traveling, I love breakfast, and while I want my food fast, I don't like fast food restaurants, I like to sit and eat it and Denny's is usually the only and closest place we can find. Convenience.  \n\nEvery Denny's I go to has dirty menus. Why is it so hard for the staff to wipe these plastic menus down? They're either sticky or have a hair in them or something and it's always my menu and no one else in my party. Grosses me out... immensely. The restroom was also filthy. Even most McDonalds can maintain their restrooms so I don't understand why it's so hard for Denny's. \n\nAs for the food, I kept my order simple with bacon, eggs and pancakes, and I was happy with my food but they didn't have all our orders out at the same time. Twice, on two separate visits to this location, someone in my party had to wait to get their food while the rest of us ate.  The chef also did not make some of the food correctly giving us runny scrambled eggs, lightly toasted bread that didn't appear it was even toasted, the steak wasn't made to order and they completely messed up my moms order but she was in a such a good mood, she wouldn't allow me to complain for her. \n\nAnyway... Denny's, you guys really need to step your game up. Hire better cooks and train your staff to clean, clean, clean your Resturant! C'MON!","useful":1,"user_id":"6JsWSs8ususnXSCb_8HKXw"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2016-09-22","funny":0,"review_id":"KEcc4r8zYWWBomuMTT6VpQ","stars":5,"text":"This Dennys is Amazing !! The staff is so friendly and the food comes out so fast , I would recommend this Dennys to anyone","useful":0,"user_id":"Qn92K8FIsKmnQNDyViK9Hg"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2014-02-26","funny":0,"review_id":"2BhdGjC_mUPrKc8QlD91VQ","stars":1,"text":"i haven't been to a denny's in years......used to love the slam breakfasts and the shredded potato hashbrowns......but memories were ruined by what is now denny's.\nfor starters, what could i expect....it's a classic greasy spoon style restaurant, but i've been to plenty of greasy spoons before, but they usually have great, friendly service and the food is served up quick and hot...........\nour server was the poorest excuse for a server i've ever experienced. even with the name tag celebrating his 14 years of service. it took 30 minutes to get breakfast in a restaurant that was virtually empty. our server was more consumed with reading a magazine in the server station than filling our coffee, water and teas......the coffee, by the way, was full of grounds, had to ask for another cup of coffee, sans grounds.\nfood was sub-par, server asked how everything was, after we had eaten it,. leaving alot of it uneate. we asked for the check, he disappered, we waited another 10 minutes, then finally asked the hostess for our check, paid and left.....\nthe best part of this meal was seeing denny's in my rear view mirror!!!!","useful":0,"user_id":"V2YLI2Eo4ArlAwpYxRWczg"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2015-02-12","funny":0,"review_id":"iF_vOpWRA-xFj6uRFpio_w","stars":4,"text":"My husband and I decided to use a coupon from a book I bought , bogo deal . You can't beat a weeknight special from time to time . We were greeted by a very friendly man who enthusiastically showed us to our table and then we were welcomed by our server MAT , with one T. I have to say , Mat was amazing !  He was curtious , friendly , smiling and made menu suggestions that helped us in our ordering . I really hope he does well  in life , seems like he deserves good things . As he checked us out at the register , he told us to be safe outside and we told him the same . We found out he doesn't have a car and walks to work , if I were a millionaire, I would have bought the kid a car.....that's how good he was !","useful":0,"user_id":"GfOy6HCVzMyCfDtuQ4czeQ"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2013-02-19","funny":0,"review_id":"1FIvHZdvBQx6OUNR7krUnQ","stars":1,"text":"DON'T GO HERE!!!!!! been going here and on off since i was a teenager which has gotta be for over 15years. Just moved back to cleveland last year and i stopped in about 3 or 4times so far and everytime has been TERRIBLE. I will never go back here again after tonight. went there for a late night breakfast.......the waitress made us wait forever even though she only had 2 tables, she then greeted us and rambled through the list of the ten things they were out of because they don't get food deliveries until wednesday (today was monday.......so nothing for 2more days!?!?!?). She took forever on their dumb computer system seemed like she didnt know how to operate it. She couldn't do a substitution for me cuz she didn't know how to do it on their system. I ordered the belgian waffle slam and the waffle tasted like crap....seemed like they just heated up a frozen waffle. the bacon was old n cold.....tasted like it was cooked that morning.  My gf ordered  a sampler which was the only halfway decent thing we got, she also ordered the country fried steak with their smoked cheddar potatoes which tasted like old dried potatoes that had been sitting around for a day or two. Idk if they changed food distributors or what cuz the food has gone way down hill. The cooks you can tell don't care about their jobs cuz all the food is either overdone or underdone or cooked wrong. The waitress was not good, besides all the times she made us wait and messed up the order and forgot to bring us stuff she ended on a high note by ringing us and the other table out backwards so she had to get the manager to reverse it all which took an extra 10minutes which woulda been fine if the food didn'\/t make me and my gf so sick we just wanted to leave. The management must not care because the place looked horrible, i saw drips going down the sides of the booths from people washing em down but not drying it. The tables and menus were all nasty. The owner must not care about the place or the customers otherwise he'd be on top of food supply orders and the nasty appearance of the place, the lack of cleanliness, poor staffing. I imagine he just sits back and cashes a check.........my dennys visits this year have been the WORST DINING EXPERIENCES OF MY ADULT LIFE. NEVER AGAIN","useful":0,"user_id":"RCrfj9GaKF4isWSIRfEPjg"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":3,"date":"2010-07-13","funny":4,"review_id":"JDQE-sD-0BfTRZXAaIlZGg","stars":1,"text":"I left. We were greeted, seated and drinks were brought out. Then...... nothing. we waited and waited. Crickets chirped, other customer came in. They were seated and drinks brought out for them. Then the last straw for me was when their waitress took their order, whilst ignoring us. So we decided to leave. I walked to the clerk, asked for the bill for the coffee. The hostess who seated us, asked what happened. We told her and she did try to get us to stay and comp our meal, but I was ticked and couldn't enjoy myself if I stayed. So we left.","useful":3,"user_id":"RWGJvGak18-mXGYQo5wFUA"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2015-09-11","funny":0,"review_id":"BoQB2x3cySht_R7SU-mwgQ","stars":2,"text":"Food is good but the restroom is dirty. They need to clean it. I try to avoid using the restroom at this location.","useful":0,"user_id":"nX6-QUKGqtnfo53-nmckLQ"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2016-04-01","funny":0,"review_id":"x1Kb770bJyfby6YjB9M62A","stars":1,"text":"I am here right now and I am finding that this place has the most rude waitresses that you could ever imagine. First I sat for over five minutes waiting to even be acknowledged, and then when I was it was a very phony, friendly waitress. When I attempted to get some ice, I said excuse me to two different waitresses and they both totally ignored me. Not the kind of place you want to come in and be expected to be treated with some kindness unless you are a regular which I'm watching the waitresses hug obvious regulars.","useful":2,"user_id":"8my6RpruAjeRWzQwuUB0hA"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2017-05-15","funny":0,"review_id":"nGrHO-N41uS87R2mISKZPg","stars":1,"text":"I've been to this location several times without issues but today I can say I'll never return. First of all, the staff is extremely unhygienic looking and also very unprofessional. We got our table and it was under the air conditioning. We froze the entire time! It was only about 60 degrees outside!! And to make this experience even more magical, we all got our food at separate times, by the time the last entree came we wanted to go boxes and to get out of there. We sat for another 15 minutes waiting for our bill. Not to mention the fact that our server never asked anyone if they needed drink refills, just nothing. It wasn't insanely busy, there were other staff members walking around. Would never recommend to go here.","useful":1,"user_id":"A1ejStXAS_KGTlrPHyGSyA"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2013-04-18","funny":0,"review_id":"jmAKLA3_loO_3maXIHVYyQ","stars":2,"text":"Hmmmm....\n\nMaybe not so good. There is a reason why I stopped eating a Denny's when I quit drinking 24 years ago.\nThe food was bland and overcooked.\nThe service was lacking and does no one ever answer the phone?\n\nIf this place wasn't the only place for a mile and next to the Marriott, I would not have gone.","useful":0,"user_id":"qEv3LrfTm95_VJfU0hFQwA"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2013-08-14","funny":0,"review_id":"5pIU5I1lsi3kaPADjpnpmw","stars":2,"text":"I now know why Columbus doesn't have much if any Denny's left.  I used to love to go to Denny's, but this visit was not reminiscent.....\nThe french fries were tasteless, and the mozzarella sticks were still solid in the middle.  The quesadilla and chicken fingers were edible.\nDon't chose this location simply because of the location.","useful":2,"user_id":"lqy9arkXu50bOXrvDnQ5SA"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2016-12-08","funny":0,"review_id":"slv5hpPJiLI2BhTgmSG7dw","stars":5,"text":"Went in for a meeting this morning. Great food and drinks. The server was excellent coming in to refill drinks but not bugging us.","useful":0,"user_id":"OxlDNwFcrbrdoUh5qJ9uyA"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2013-07-29","funny":0,"review_id":"mlCXWa3d96AaHHGAeqL1NQ","stars":1,"text":"I have been going to Denny's across the country since I was a little kid. As mentioned by another reviewer, generally if you have been to one, you have been to them all. I don't mean it as a bad thing - I like to know what I am getting especially if I am traveling and need a quick 'sure thing' dinner, especially with kids. \nWe were staying just down the street from this Denny's this past Friday (7\/27\/13). They were clearly short staffed. It was not very crowded but we had to wait a while to get seated, get our orders in, and then to get the food. It did fill up by the time we left, which I am surprised about given how the meal tasted.\n\nThe food was atrocious, I mean borderline rancid. None of us could finish our food  and several of us are the types who always clean our plates. The salad appeared to have been sitting around for days, the soup smelled rotten. The oatmeal must have been made by somebody who is not familiar with what oatmeal is, because it looked as though the person poured the dry oatmeal into a bowl, then put half of the usual amount of liquid and then served it. It looked like granola, it was so dry. When we asked about it, the server said, 'I didn't cook it.' Even the pancakes were bad, rubbery and old-tasting.  I honestly don't know how you could screw the meal up worse than it was. It was as if they took outdated food, then had somebody who didn't know how to cook make it. I ordered a wrap with avocado and I don't think there was more than one sliver of avocado, though maybe I should be grateful because it was probably old too.\n\nDenny's should be ashamed that this franchise uses their name. We all know that Denny's isn't high cuisine but you should expect a minimum level of quality from a national chain. This place is terrible. Do not go unless you want food poisoning!","useful":0,"user_id":"cGVAutBuX5PuAbrkoiRkxw"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2011-07-26","funny":1,"review_id":"6z3jtomgr8dhzg45_9OMVA","stars":5,"text":"Home of Linndale, OH known for traffic ticket revenue, but anyway....\n\nI like this Denny's. Have taken my family & have had business luncheons there too.\n\nI do plan on visiting again.","useful":1,"user_id":"w8q1hum7FsGb6hb9T_2j2g"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2015-04-22","funny":0,"review_id":"reyhElUt_NNHDWGaCsyGIg","stars":1,"text":"The food was ok, however the coffee was crappy along with the service. Asked the waitress for a hot cup of coffee because as everyone in my table pointed out it was old and cold. What I got was attitude from the waitress who said that was the hottest it got, then asked, are you going to drink it or do you want water? That was my first experience as a first time visitor to Cleveland. I should of walked or at least spoken to the supervisor.","useful":0,"user_id":"s95NeQF5NaXF4zRlQWNnMg"}
{"business_id":"B_ouKNVsEDrGHwec280CAg","cool":0,"date":"2015-12-13","funny":1,"review_id":"Qrqu_fmhBFVJUEpAQCPF-w","stars":5,"text":"One of my favorite locations!! Always good fast and friendly. Go at off times to avoid Mama June and Honey Boo Boo. I always try to sit either near or at the counter to avoid it.","useful":0,"user_id":"243VUTbQBl8ozvZC3fV0zg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-10-17","funny":0,"review_id":"1gSqEHNC9i1ePd9jEYmM9Q","stars":1,"text":"We were looking forward to eat here after hearing multiple raving reviews. All employees were super nice and helpful. Unfortunately, the food was not good at all. We were there with a large group so there was a variety of different foods ordered. Nobody in our group was happy as the meat (beef and lamb) was tough and not tasty. Tabouleh salad was too sour and grilled veggies were soaking in oil.","useful":0,"user_id":"xjgTl7H3sVLYoxdWIssGNA"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-06-07","funny":0,"review_id":"r9mXkGhsDr9pWdal8lRvbw","stars":5,"text":"Nice, authentic middle eastern (I want to say Moroccan) feel. My husband loved his lamb and rice dish, and I ordered the tea and freshly made French cookies, both of which were delicious. We were also served freshly made bread as an appetiser.","useful":0,"user_id":"9p3rDPd-eRm2X8E9w_OXvQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-01-08","funny":0,"review_id":"NsjiIu6AnOe1Ag5IOBhv8w","stars":4,"text":"I had their beef kebab and it was excellent!! Very reasonable price ...will be back to try some of their other entrees.\n\nDropped in again, after three months, for take out kafteh kebab... Very good again ... cooked to perfection with a delicious side house salad that was savored!","useful":0,"user_id":"KKS97DndTcypcizR5sApTg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-08-24","funny":0,"review_id":"36Va4TTulIqoh-eIfFC2Wg","stars":5,"text":"Food was delicious and well priced! We got one of each platter and they were all delicious. Mint tea is a must and super legit. The guy waiting on us (the owner) was very sweet and talkative and obviously very passionate. I loved this spot, get the cookies too for dessert.","useful":0,"user_id":"mURf9R_QNPdq81lAFQKLoQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-02-19","funny":0,"review_id":"O6iOFxW-n2kgKcMi9SfzaQ","stars":5,"text":"Fantastic little spot.  The food and tea were both delicious, and the owner\/operator was very welcoming and kind.  We will be back.","useful":0,"user_id":"cbz-Frpoz62QGX66YZqZ1w"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-04-09","funny":0,"review_id":"Eou9MThx75KJTgiLEhJf9w","stars":4,"text":"Lovely family run spot - excellent food though a limited menu. Had the beef refine and lefts kabob with salads and fantastic tea.","useful":0,"user_id":"e4j_Thay8LJCIDwoZ8VjHw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-06-19","funny":0,"review_id":"Qvi52L65tNvvt_oqKWALwg","stars":5,"text":"Was surprising the food is so delicious and salad is very fresh in this small restaurant. I had lamb and it was tender. I AM GOING T TRY COUSCOUS NEXT TIME,  OH,  AND FALAFLE.","useful":0,"user_id":"eB-ryqGBIVeNL0-mm88r0g"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-04-05","funny":0,"review_id":"iYMxd7Hb205LKbhj4UM6vA","stars":5,"text":"What a great new restaurant on Lee Rd!\nI had the Tagine and my significant other had a kebab. I haven't had food that fresh from a restaurant in a long, long time. I would go there everyday just to have that salad! To top it off - the prices are amazing. We both ate for under $30. Can't wait to go back.","useful":0,"user_id":"Ozp9AQ9EOaw3ZQnVE6TDFA"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":2,"date":"2015-07-20","funny":0,"review_id":"zSopWqLfIfCUvR9wYdUlcg","stars":5,"text":"On a Sunday night we were looking for someplace yummy to eat and came across this place on yelp. The reviews don't lie it was very very good. The place was cozy and welcoming with an authentic style. We started off with the moroccan tea which was minty and sweet. Then we got the tazine and lamb. Both were different but very good. The meat was not dry very soft and moist also full of spices. We will come back here again. Ohh and the owner is moroccan and he is the cook and makes everything fresh.","useful":2,"user_id":"TBihDgU1iEQ7-qSl3L5yjg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-02-05","funny":0,"review_id":"F5AnyO2UBqcD_tuc9RZolQ","stars":5,"text":"Food was amazingly complex. Atmosphere was relaxing. The place was packed on the Saturday we visited - and for good reason.  An experience like no other in the Cleveland area. Staff was fantastic. Mint tea was perfect.  Main course was delicious.   I highly recommend Momo's - try it and you too will be pleasantly surprised.","useful":1,"user_id":"QedyUyPfN-cq1FH8yVfn0w"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-07-10","funny":0,"review_id":"E3MLVWTSvKmRxctHhNC3QA","stars":4,"text":"I was stopping at Cleveland just for a night and found this place. I like the decorations - looks genuine. I ordered the chicken plate to go, it came with 4 pieces of grilled chicken, vegetables(eggplants soooo good), rice, Moroccan bread and salad!! And spicy sauce was good too! I saw others ordered tangin - looked so good. I wish I could have that too.","useful":1,"user_id":"JAG9gPVGqaLvq-mc8HSL4A"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":2,"date":"2016-11-05","funny":0,"review_id":"Wt9vksjM1DXLyvlExTS2pA","stars":5,"text":"First time here and I would say it was a great experience. It was shared that the meat is Halal which was nice. Mohammed, Mo, is a fantastic chef and conversationalist. You will not be disappointed.","useful":1,"user_id":"yN9OJF-GrI_dFrtUpU-O9Q"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":1,"date":"2017-05-04","funny":1,"review_id":"tkCfznZ5aYRjc-GxFzH8HQ","stars":4,"text":"Stopped in last Friday at 7pm after having it bookmarked for the past few months. Decor is cute and space is clean and well-lit. There appeared to be just two employees there- a cook in the kitchen and a waiter. We were seated when the restaurant was about half full, and people just kept coming in after us. Thus, service was a tad slow as the one waiter raced around to all the tables. I didn't mind, but if you're in a rush, beware! \n\nAll that aside I enjoyed the food. I ordered the Kefta plate and split chickpea soup and my boyfriend got the chicken. The chicken was ok, a little bland. The Kefta was wonderfully seasoned and cooked though! The food is very wholesome and \"clean\" tasting. I'd come back!","useful":1,"user_id":"xU7H808td9xQkkxPsRjjFw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":1,"date":"2016-08-14","funny":1,"review_id":"0wVSzCALWUcclP3hXe1TIg","stars":4,"text":"We haven't had good moroccan food in cleveland in quite some time. Place is a small sit down spot right down the block from cedar lee cinema. My wife and sis each had a kabob, one chicken and one beef they were both season well and pretty good, but not the best I ever had. But what I really enjoyed was the couscous which is a north african staple. The restaurant has couscous on fridays and tajines on saturday as specials. I got the lamb couscous (pictured) but beef and vegan couscous were also offered as options. Plus a pot of moroccan mint tea for $5, I will def be coming back to explore more menu options","useful":1,"user_id":"6uJaZlTF9iWprMy_jZ3_Cg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":1,"date":"2015-07-02","funny":0,"review_id":"GnJQtfdUffW8tKFotHk3Uw","stars":5,"text":"About as good as it gets! Fabulously fresh salad, moist chicken and roast lamb ( Thursday special) was flavorful and perfect. Great bread as well. \n\nThis place is small and almost a one-man-band. Relax! The food will be worth it!","useful":1,"user_id":"Htx0bjQtOsoEIVBoSbjh5g"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-05-10","funny":0,"review_id":"ZfbKlHVgA_CA-3YjygN2XQ","stars":4,"text":"(4.5) Dope place with awesome tea and delicious cookies. The menu may be simple but the food is all great. Even the bread is delicious! Everything tastes extremely fresh. It's like the chef just bought everything the same day. \n\nThe service is great and courteous. If you get the mint tea the server will give it to you the Moroccan way!","useful":0,"user_id":"ddG8kqjZxPeOgFlRstM1Vw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-06-26","funny":0,"review_id":"SlWyTxrNXZRLMjcZU57gwQ","stars":5,"text":"I've been on a reviewing spree for this place.\n\nHad beef, rice and vegetables. Served with a salad and khobz (Moroccan bread, flat and dense). Followed by traditional green tea with mint--slightly sweetened. The owner, Mohamed, emphasizes on his website and social media presence that the food is fresh--which is very apparent when eating.\n\nThis is not a knock on MoMo's but more of a warning for parties that have unrealistic expectations of the service when they have a party of six or more: you cannot expect a small establishment to accommodate you--be flexible and not entitled. One can quite literally peer into the kitchen and see the capacity of the grill and preparation area. The food is made to order. Do not have unrealistic expectations of a small business that does a exceedingly good job.\n\nIn summation: best for smaller parties, wonderful for a date, and intimate conversation.","useful":1,"user_id":"vMG6XwBk9dcYYefgy3HmyA"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-08-13","funny":0,"review_id":"j86cMNrKRjbqi1lswdCIgQ","stars":5,"text":"The \"Thursday Special\" of lamb has phenomenal spice! Delicious! Salad was extremely fresh.","useful":0,"user_id":"JZRKusMq93Ltsz6PQ08DOQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-04-09","funny":0,"review_id":"vA77mToAxs2ayJNcCNyUcw","stars":5,"text":"We have been to Momo's several times and love it. A friend called it a \"real find\": intimate, atmospheric, unique, and serves delicious food. All of the food is extremely tasty and of the highest quality. The mood is casual but festive and colorful. We were in Morocco three years ago and just melt with bliss when Momo raises the silver teapot up high to pour the mint tea in the traditional way. A perfect restaurant for something different, reasonable, and delicious.","useful":0,"user_id":"Ufh6dxK4TrVm5FgTV2dpTg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-10-18","funny":0,"review_id":"w_5MxX0onmNB509xSZH1-A","stars":5,"text":"I've been to this restaurant several times and have ordered multiple things on the menu- all delicious with equally great service to match. This evening, I came in for my usual Tagine( a Saturday special) and there was already a big party there in addition to several other patrons. As a regular customer, I know the chef runs a small operation and was (understandably) busy.  \n\nOne loud woman at the table was behaving egregiously, loudly complaining about her \"disappointment with the serve,\" her meal being \"inedible,\" and making continuous unreasonable demands at the already short staff( by the way, a couple who are the nicest to the bone people I've ever met). This terrible customer continued her complaints loudly, nearly ruining my meal.  She came in there with a chip on her shoulder, ready to take it out on anyone no matter what.\n\nThe only reason why I am rating four stars is because I wonder at what point do you have to cut a customer off in order to prevent her\/him from ruining it for other patrons?  It's too bad that the staff couldn't focus their energies towards more positive, grateful ( not to mention regular) customers.  \n\nI'll continue to go to Momo's because his food is delicious and the service is great. But in the future I hope they stand their ground more.","useful":0,"user_id":"mWF_r-7Wi0jnPVTGp6steg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-07-03","funny":0,"review_id":"VnZ-ovL5cbVq-v3Q69_8Vw","stars":5,"text":"Fantastic. Small menu but that's because it's a high-quality, small-scale place (just 8 tables). The couscous with beef and vegetables (Friday special) was superb. Last time there was a great Moroccan restaurant in the Heights, it didn't get enough business and closed. This place is just what Cedar-Lee needs, so go try it! Tonight they didn't have lamb-- but it's because the owner didn't like the look of the lamb at the market and wouldn't serve something not up to his standard. Now that's refreshing. Most places do not source so carefully, so I'll look forward to lamb another night.","useful":0,"user_id":"agWoa2je21wiq2Rq8Hngkw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-02-25","funny":1,"review_id":"mYTt6sXbUanjbc88DyCQqQ","stars":5,"text":"Delicious Beef Kebob. Very fresh and well seasoned. Ultra adorable decor too!","useful":1,"user_id":"zLfLGCBArA6jZd36leNnFg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-10-19","funny":0,"review_id":"gBHvvM-GZs8y1-LqCnb8_A","stars":1,"text":"Unfortunately I only give 1 star to this restaurant and this star goes to the nice staff of the restaurant who will bend backwards for customers. I wish the food matched the staff's efforts. Meat was chewy, under or overcooked in certain cases (we came as large group). Rice had no taste at all. Tabbouleh was way to bitter to enjoy. Salads were tasty. I will say that split pea soup was excellent. I believe that the restaurant has great potential because of its location and otherwise excellent Moroccan cuisine. Unfortunately the quality of food is far from good. We came after reading positive reviews but we will not be back there.","useful":2,"user_id":"s-gTqGLgKxDrCqDjsir_VQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-09-05","funny":0,"review_id":"fzkudjCxJRW3pTduJjX9Mw","stars":5,"text":"MoMo's is an absolute gem of a restaurant!  The food is incredibly tasty--perfectly spiced and cooked.  All ingredients are fresh and high-quality.  If you are looking for truly outstanding, authentic, healthy food--this is your place.  Our server was incredibly attentive and welcoming.  Price cannot be beat--we fed our family of 4 here including fresh salads, delicious moroccan tea for all, generous meals, fresh-baked bread, and the amazing French cookie sampler, all for under $45.  We truly enjoyed this place and recommend highly to others!","useful":0,"user_id":"mJS_GfRQ9NZvo1XRiV5pcQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-05-06","funny":0,"review_id":"WKrfqw0p3DFCJgOm_gnf5w","stars":4,"text":"The food is simple and good. We had the Friday special, a couscous with beef -- hearty portion with plenty of carrots, potatoes and squash. We also enjoyed the kafta kabob--a little spicy, but not dry like some kabobs.\n\nVery small establishment, where you might be served by the chef. Very well priced. We'll be back.","useful":0,"user_id":"SOaJL315uK9uIy2xSzZX5A"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-02-13","funny":0,"review_id":"WvW2B54quLWQHCpFlMUOiw","stars":4,"text":"Went here the other evening for dinner - I really cannot say anything bad about it.  It's not the most amazing or fancy place but the food is wonderful and the people are great.  I Highly recommend.\n\nDon't be afraid to try something knew or to ask for recommendations if you have not tried something - they are very helpful with explaining things.","useful":0,"user_id":"b8vslHjht8t8SmKO0CKC3Q"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-05-06","funny":0,"review_id":"FYPxsKIS3G8V9O9sB0We4A","stars":5,"text":"A wonderful restaurant. Good fresh Moroccan food. Chef MoMo is a knowledgeable and gracious host. And the price is reasonable. I have one minor quibble-no ice for drinks. Overall, do yourself a favor and go and support this local gem.","useful":0,"user_id":"emFCJmpXxKbmltR0qA1D1g"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-01-07","funny":0,"review_id":"V1hr9EbbYXNMPBitVacicA","stars":5,"text":"Food was very delicious and the owner is very friendly. Definitely try Harira, tagine and cuscous.","useful":0,"user_id":"V9ckx_o1ZsZzSyeh6BxNOw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-08-28","funny":0,"review_id":"LLXecaHaimJAFp035cSdlg","stars":5,"text":"We will definitely be back.  Mo was very friendly and the food was phenomenal.  Be sure to stop by and you will leave full and happy!  Kefta was superb!!","useful":1,"user_id":"5wV1mrvsH4ALKYDJgwIwCA"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-09-29","funny":0,"review_id":"PjPxgUmSgj-lrZeQK_K5yA","stars":5,"text":"The food was fantastic (lamb medallions) and the service was excellent. The food was cooked to perfection and tasted very fresh. The owner is very personable, friendly, and attentive. Make sure you tell them if you want the tea or not because it will be added to your bill. We never asked for it but it was presented so we thought it was included. Enjoy!","useful":0,"user_id":"OVOoEO6x1ZFP65hX1NRrPQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-08-30","funny":0,"review_id":"7iYZMnS_RrrXDi8GBVRLjg","stars":3,"text":"A huge fan of Mediterranean\/Middle Eastern (MME) cuisine, I was glad to see another one pop up in The Heights as another option to Anatolia. Such a peculiar name, just had to try it. Brought the family. Cute and colorful little place designed and laid-out with Moroccan-themed decor. Our server, who was awesome, started us off with some bread. Not sure what kind it was - never had it before - but it was semi-flat, grainy\/wheaty with a denser consistency. I didn't care for it much and it didn't help that they didn't serve it with any butter or olive oil. We also got their Mediterranean salad. It came with a good mix of greens, tomatoes, olives, feta. It was good, but the dressing was a little on the sour side for my taste. Onto the entree. As a first-timer here, I ordered the kefta platter, which is my favorite item to order in MME restaurants. Got 4 medallions of kefta with rice, roasted eggplants, green peppers and tomatoes. The veggies were good, but the kefta was a bit underwhelming. They were dry and though spicy, they lacked more seasoning. It was the first time I've had kefta that was spicy - perhaps the Moroccan version? Another downfall for me was they had no offerings for kids. Ended up getting the kefta sandwiches for the kids as I thought it would be the closest thing to a hamburger... not knowing they were spicy, the kids didn't care for them. Plus their sandwich is \"deconstructed\" and served with the same bread when we first sat down. As it was a flatter bread (not pita that you can use as a wrap) we were having trouble figuring out how to fit the meat into the bread, so I just cut a pocket into it with a knife and tried our best to make it a sandwich.\n\nWe came in around 5:30PM and there were only two couples dining in at the time, but it quickly filled up to capacity by the time we got our meal. Our server was by herself and she did the best she could to accommodate everyone while still having a smile on her face and a great attitude.\n\nThough the menu is pretty modest (which I prefer most times), they have some other offerings that I'd like to come back and try. Aside from the kefta that I had on this visit, they also offer beef and chicken kabobs, tagine and other daily specials.\n\nThis visit didn't blow me out of the water, but am curious enough to try other dishes on the menu to come back.","useful":1,"user_id":"4U628IMVQaGuy1wuhy4BNQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-07-22","funny":0,"review_id":"lPL231nXtEtciAx6aSzHWQ","stars":4,"text":"Nice little place, with a very pleasant chef\/owner. The food was freshly prepared to order. The portions were fairly small, but adequate, and proportionate to the cost. Two of us ordered sandwiches, which included a small salad which was served first, and was very tasty. The sandwich was served with homemade flat wheat bread, and roasted veggies. The beef was a little tough but very flavorful. I think the kefta looked like the best bet. Worth a trip if you're in the area.","useful":2,"user_id":"PACS2nRQfwS7fYHNBL4ozg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-06-07","funny":0,"review_id":"YMgvoH9g39dghvcy5QhYlg","stars":4,"text":"The menu is small and simple but is fantastic. All of the kebob platters are delicious and now they have the lamb special daily. Try the mint tea, Harira soup and a kebob. My only advice would be don't come if you are in a rush since depending on the time of day the chef may be the only one working there. Otherwise it is A+","useful":1,"user_id":"JQRclzXEo6AMZ-GUPlJgrQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-11-22","funny":1,"review_id":"IxmHq2ShApg564-5RpVguQ","stars":2,"text":"Really disappointed. Owner was very nice but we've had much better. Salad had a dressing that tasted like pure lemon juice, bread was dry and tasteless. My chicken kabob was ok, but my husbands beef kabob was dry and tasteless like the bread. Very few choices on the menu. We will not be back.","useful":0,"user_id":"q1AQXsOcXAs3TmnfuQh5BA"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-08-20","funny":0,"review_id":"m_LgrpHKA1bFFbU3no3huQ","stars":5,"text":"Superb! Try the tagine special on Saturday. The meat is tender and juicy; the plums, raisins and onions add a hint of sweetness. Service is quick and polite. The prices are ridiculously low.","useful":0,"user_id":"wpw9k8kcoBTDxpYSfSQK0Q"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-06-01","funny":0,"review_id":"KNRQiiNVneFR77nr605aWg","stars":5,"text":"Had lunch today for the first time at Momo's and it was delicious! I got the lamb while the husband got the chicken kabob. Came with rice, roasted eggplants, tomatoes and peppers, homemade wheat bread and a side salad. The salad was fresh and seasoned with just the right amount of oil and vinegar (best salad I've had). The lamb was tender and flavorful but not overwhelming. Chicken was perfectly cooked! We'll def be back!","useful":0,"user_id":"Q-LUmBqNHUhMSnmyaPGbUQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-09-12","funny":0,"review_id":"ywy3Hj_v3Duio8TLnnZfNw","stars":5,"text":"YES, YES, YES, and YES! The genius of Einstein combined with the culinary acumen of Gordon Ramsay. Momo's is making a statement and it's a delicious one. The tagine is to die for and by far the best dish on the menu (but only available on Saturdays). Easily one of the best (and most unrecognized) restaurants in Cleveland. This place is a true gem, I can only hope it stays hidden.","useful":1,"user_id":"dUGwfQfKYiM3qWt-FvVPZQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":1,"date":"2016-09-01","funny":1,"review_id":"0GpEJz-sg9D07alwk9ijgw","stars":5,"text":"I can't remember the last time I had Mediterranean style food this fresh and tasty. I don't even eat bread but how can you not resist the hot oven fresh bread right in front of you. The rice was done perfectly it was a great complement to the dish. The vegetables that complement the dish were also well done.   The finishing touch of the Moroccan tea slightly sweetened poured at the end of the meal was a perfect finish to a great lunch. I am very excited to go back very soon.","useful":2,"user_id":"KT97taQ93dLyMMLDCGGj_A"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-02-12","funny":0,"review_id":"-M0YiC4C-E8UTJczudHlIw","stars":5,"text":"This is my favorite restaurant in the Cedar-Lee area. \n\nThe food is superior in quality to anything else in the area, and you don't leave feeling like you've committed a mortal sin against your digestive tract and coronary arteries. \n\nWe go here when we don't want to cook but want food that tastes homemade.\n\nDefinitely go to MoMo's. And then do it again.","useful":0,"user_id":"6ZY1Lvi4U2CIK0Vf66VOgQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-09-05","funny":0,"review_id":"LHdNDMKsghuzWDWJ14n2qg","stars":5,"text":"Had dinner here and loved the place! The owner himself waited tables and split his time in the kitchen. He speaks English\/French\/Arabic with customers and is absolutely charming -- apparently he came to the US from Morocco in the early 90's. There's room for maybe 20-30 people max, so it's pretty cozy and perfect for a small family outing or date.\n\nWe ordered tabouleh, marinated grilled beef kebab platter, and Tagine lamb (despite what the menu says, it's now offered on Sundays as well). Everything tasted super fresh, and we were served warm bread with our starting salad. The beef kebab was especially tender and delicious, coming with a zesty sauce that had a spicy kick. The Tangine lamb dish comes as a stew and is more of a comfort food -- really loved its presentation in their custom glazed pots.\n\nIn addition, we had the Moroccan style green mint tea and it was fantastic! The tea had a strong, rich flavor with a bit of sweetness, and it perfectly complemented our meat dishes. Highly recommend it.\n\nDefinitely will return and try some of the sandwiches for lunch!","useful":0,"user_id":"oedRpRXhwfo9NY_Q43rF8Q"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-06-11","funny":0,"review_id":"CBS_8SRndM51FzPFRhpobA","stars":4,"text":"First Rate! \nThe chef greets us at the door with his tall white hat and brings cold water and lovely mint tea, slightly sweet and refreshing. Soon, the special of the evening arrives, cous cous with lamb for her and beef for me. Hot, a little spicy, full of flavor, chunky vegetables stewed the traditional way, this restaurant captures the authentic Moroccan flavors, without fanfare, but with pride and delicacy. \nThere is a soul satisfying, home-cooking quality to good Moroccan stews, and Momo's has it!","useful":0,"user_id":"Dk516AUVjnBj5q5c59Icug"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-07-02","funny":0,"review_id":"FWuWYm7uWbRIiRq700smNg","stars":5,"text":"I've been here a few times now! I live the mixed grill chicken dish, very earthy in flavor, no salt, pair this with the hot morrocan tea and it's a pretty healthy meal in my book! You receive service from Mohammed himself in which he displays his passion for delivering great service and a quality product!","useful":0,"user_id":"w4zdOaMGvSdKVBDS2vIaWQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-09-08","funny":0,"review_id":"bdwzsCAkkxcsl0U0b_ISuQ","stars":5,"text":"Exceptional. Well priced, phenomenal service, fresh and high quality ingredients, and delicious food. I had beef kabob, rice, and vegetables, accompanied with the fresh, made daily in house bread. The meal was served with a great salad, which may be the nicest house salad I've ever seen. I found myself returning the next day and tried the chicken kabob, which was again perfectly cooked and seasoned. For the price you get a very good amount of food. They don't over do it at all, you will feel satisfied after your mean but not overly stuffed. I have no hesitation returning to this restaurant and recommending it to others.","useful":0,"user_id":"dzGrH_IYlidXaSSpmrltnw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":1,"date":"2017-01-21","funny":1,"review_id":"fHkxYcWDsup4Y6EE1rL9hw","stars":5,"text":"If there's one thing people should know about Cleveland, it's that we do have establishments that are culturally enriching. MoMo's is a perfect example of that cultural diversity - a small, cozy restaurant owned by a Moroccan that has distinctive decor and serenades you with Moroccan music. It's the closest you could get to Morocco without a passport and plane ticket!\n\nThe interior was clean, with bright colors and painting on the wall that provided a warm, exciting atmosphere. There were small tables and chairs available, as well as two bigger wooden tables that sat lower to the ground and used a comfy looking sofa and squishy chairs as seating. \n\nThe food was amazing! My wife got the grilled beef kebab plate and I went with the lamb kebab plate. They both came with veggies, basmati rice, a side of hot sauce that's made in house, and a Mediterranean salad (which I substituted for a soup that mostly constituted of lentils and chickpeas); we also received a small basket of Moroccan bread. \n\nIt's well documented that we Americans treat eating as a chore but to other cultures it's a social event in and of itself - the food at MoMo's brought a whole new attitude to eating for us. The food was good, but not overly rich - we found ourselves taking smaller bites, talking more throughout our meal, and focusing on how good the food made us feel. It was an amazing change from the way we normally eat, and was only made possible by the combination of atmosphere and food at MoMo's.\n\nThe tea was amazing as well - I'm normally not a fan of mint or green tea, but the way the mint green tea here is prepared makes me a fan! The tea is sweetened and the best way I can  describe it is a slightly sweeter taste than spearmint gum. The way it's served is an experience as well. \n\nThe staff was great too - the host\/server was nice and open to questions about everything. The chef was incredibly kind and enjoyable to talk too - and also wanted to make sure your questions were answered (ask how the tea is made - it's a process that will make it even more incredible to you). One thing that struck me was that the chef carries your plates out to you and serves them you,so everyone gets to meet who cooked the meal. \n\nThis place exceeded all of our expectations and I highly recommend it to everyone!","useful":1,"user_id":"eR8fBtTjtFDuEwhxEYlEeg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-04-04","funny":0,"review_id":"wYvVuZkePope-p4NsKgWTA","stars":5,"text":"What a nice surprise! This place looks like a little hole in the wall joint that may not may make you think it's going to anything special but the food is really tasty. The chef (and I presume the owner) takes your order and does a great job answering any questions. The food is fresh, flavorful and unique. I tried the beef kebab sand which . It came with a delicious light side salad with a savory dressing, olives and cheese. The sand which itself wasn't put together as a typical sand which but came with two small rolls of their tasty home made bread and vegetables and the beef in a sauce. I built my own little sand which and it was delicious! And just enough food to fill me up without overdoing it like so many other restaurants out there. My husband wanted to try their French pasty cookies so we got a few of those and they were good as well. Different than your typical cookie, but on point with the overall uniqueness of this gem of a restaurant. Sadly, there was only one other couple in the restaurant dining with us. I hope the word gets out and this place stays in business for a long while so I can come back!","useful":1,"user_id":"06q6Uvv6rRIDewp326IX0Q"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-09-13","funny":3,"review_id":"ihS9ThDXi2RkVkM9lVITNg","stars":1,"text":"Tried first time today, certainly a joke not a restaurant, ordered tagine which was not fresh at least 2 days old starting to go sour with a single piece of meat and lamb which was over cooked:\n\nI didn't like the place at all, poor food quality , small portions and high price. Unhappy and will not come back","useful":2,"user_id":"CoNKnZbxBaXp0oXGdEgwkQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-06-18","funny":0,"review_id":"tqTYNzbL33W-dRhzaCEVVQ","stars":5,"text":"Stopped in for lunch and was pleasantly surprised.  Delicious chicken kebabs, warm, bright atmosphere and a fantastic host, who is an intelligent, well-travelled man.  The wheat bread is made in-house and is served warm.  Everything is fresh and flavorful.  I'll be back next time I'm in Cleveland to try the couscous.","useful":0,"user_id":"eye4SC65_nWy23XSJJSiXQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-08-10","funny":0,"review_id":"RqW3_SCdsZeADxMWUsO1JA","stars":5,"text":"This place apparently just opened 5 months or so ago, so glad we discovered it! It's a small restaurant but the atmosphere is great, it's nice and clean, and the servers & chef are extremely nice and friendly. The food is halal! I LOVE their lamb kebab and the Moroccan tea, it's green tea with a nice sweet minty flavor. Their cookies are also amazing. They serve a nice full plate of salad to each person before each meal, it's like a nice large side Mediterranean salad, and is absolutely delicious, with feta cheese and everything. The entree serving sizes are smaller than what we are accustomed to here in the US, but are definitely filling. Oh and I love that they're open late, perfect for the busy student\/professional looking for a nice cheap healthy meal. Would highly recommend!","useful":1,"user_id":"DTUTL44FGXGBJGwDthNj8g"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":1,"date":"2015-03-04","funny":0,"review_id":"NYuSHDGoYAQG8NmB2qeIww","stars":5,"text":"Absolutely recommend this one and only Moroccan restaurant in Cleveland! Three of us shared tabouli, beef kabob, chicken kabob, Harira soup, French cookies and hot sweet mint tea. They cook with a wood fired oven that brings a delicious smokey flavor to the food. Even the veggies were cooked in the oven. The bread was divine! The decor was of course very Moroccan with fluffy sofas and several colorful poufs to sit on. Muhammed is a very friendly host. Definitely check this place out!","useful":1,"user_id":"G0s1Yx2lCLQH79DMYkuHVw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":3,"date":"2015-08-07","funny":1,"review_id":"bQbzJ_H-r3ZEPzpnH_Rf6w","stars":4,"text":"We decided to give this place a try on a whim (if it wasn't for the Yelp app, we wouldn't have known it existed in our own city).  \nWe were greeted by our waitress, who was extremely welcoming and nice.  We were surprised that there was no alcohol, so we ordered the hot fresh mint tea, which is sweetened with organic sugar.  It arrived in a pretty silver pot, accompanied by two small silver and glass cups.  This is very good and is worth the $5.00 price.\nWe both ordered the Thursday special, roast lamb, which is served with a substantial side salad, baked-in-house whole grain bread, fragrant basmati rice, and grilled vegetables.  There was also a spicy sauce on the plate, so be aware of you don't like spicy sauces, ask them to leave it off.  My husband loved it and took mine.\nThe lamb was delicious, but it was not very tender and we had difficulties cutting it, but I think it was just luck and not the chef.  It was so good tasting, but there was a lot of gristle.\nThe rice was amazing; I could eat it every day.  If you're vegetarian, you will love the rice, grilled vegetables and warm bread by itself.  \nThe restaurant has plenty of seating, and it is decorated by the owner\/chef Mo and his wife (who handmade cushions and seats that are for use in the place, and they are very pretty).  \nThe chef himself came out to the dining room to personally see if we liked the food.  \nThis place has a small menu, but it's fresh and the staff is wonderful and put you at ease.  We will be back to try the rest of the menu!","useful":5,"user_id":"x7zoxuIXfaPNDl_CJOBlpA"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-09-24","funny":0,"review_id":"i2v2qB59_xFZrGyV1nAkSA","stars":5,"text":"Fantastic food and service! Tabouli and bread was a great starter. Go straight for the platter options. We tried the Lamb platter and Chicken Kebab platter. Both were excellently seasoned and cooked.  The spicy sauce is awesome and made fresh daily. If you like moderately spicy food you don't need to have it on the side. Don't miss out on the tea service and cookies. It was so nice to meet the owner and hear that they buy their ingredients fresh daily.","useful":2,"user_id":"wMSRQ_iE0wEJepJiw3OUJQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":2,"date":"2015-11-21","funny":0,"review_id":"SjdXHe8aPgMrRwaoV-c3kw","stars":5,"text":"An authentic Moroccan experience! Start with the mint tea and order the special of the day. If it is beef tajine (like today's lunch), then you're in for a real treat! The owner, Mo will start you off with a crisp salad and warm bread. A few minutes after you're done, he will bring out a traditional tajine earthen pot. Lift the lift and enjoy!","useful":2,"user_id":"hBFeU-IGFQxnrAeude78Zg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-02-25","funny":0,"review_id":"kqp3DZZEv0ykp9fBVWB4VQ","stars":5,"text":"This restaurant is a gem for Cleveland. I had a lamb and couscous, and when it was brought to the table I distinctly noticed how good it smelled. Amazing food.","useful":0,"user_id":"fJ3dCH80VICTNPoRTxtxhw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-02-28","funny":0,"review_id":"52bus-CWAWBBmJBrzJcwPA","stars":5,"text":"This is a great option in Cleveland Heights. The owner is very friendly and the food is delicious! Make sure to get the mint tea.","useful":0,"user_id":"jPqFxkfBp_9MkAr1begxPA"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-07-12","funny":0,"review_id":"-97NiV0_vb0qzZoGDvIgIA","stars":5,"text":"A new gem on cedar lee restaurant row. Looks a little mom and poppy, authentic looking Moroccan plush seats right up front. Got chicken kebab salad, beef kebab platter and green bean and carrot side dish. Didn't care that much for the green bean and carrot salad, small plate Twas just ok. Lightly seasoned with some herbs. Meals also came with fresh baked whole wheat herb bread. I try not to indulge in too much bread at meals but it was warm and fresh and unlike any typical roll (no butter available but it paired nice when dipping it in olive oil). For the chicken kebab salad I only got like 4 chicken medallion but the meat was tender and flavor town! The salad dressing was a  nice lemon flavor but could have used more. The beef kebab platter came with roasted veggies (eggplant tomato) and revved up rice. Meat itself was a little dry but again if the flavor could tweet it would say #boom. \n\nGreat place will defintely come again. Prices were reasonable. I didn't feel stuffed at the end though. Unfortunately their acclaimed tangine dish is only available on Saturdays and per the owner runs out fast, however if you call ahead he will set one aside for you.","useful":0,"user_id":"L6wUxmUErIR7FJijgr6nUQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-07-04","funny":0,"review_id":"YeLX6D4a5B18spyElOTt4A","stars":5,"text":"Love it!  Food was fresh and perfectly seasoned starting with the salad.  We had Chicken Kebab and Kefta Kebab.  The saffron basmati rice that came with our platter was light and fluffy. Small, casual place, with super attentive service.  Cookies for dessert were just right.  Can't wait to go back.  Also looking forward to take out.  We look forward to trying the lamb, tagine and specials soon!  Good Vegetarian options. Just delicious.","useful":0,"user_id":"tw7_aY4HBOizJqhA0gZw3w"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-10-31","funny":0,"review_id":"QyWQ412yFsBWyyb9I0pr_w","stars":5,"text":"Awesome food. Amazing Kefta Kabab sandwich and chicken Kabab sandwich and salad. Very reasonable. I extremely recommending this place.","useful":0,"user_id":"sJmPYUVrknwuCA8Be1K4lQ"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":1,"date":"2017-04-12","funny":1,"review_id":"QZaDS31KyXvhEs4jaqJxbg","stars":5,"text":"On a Sunday after church drive down Lee, Momo's Kebab caught our eyes. A quick search on Yelp intrigued my husband and I to venture into the small restaurant where we found a quiet dining room with a few small tables and chairs. The room was clean, with a Mediterranean ambiance, and we were soon greeted by the owner, who I believe makes all of the food as well! There is a story about his travels and his passion for cooking on the menu. We could tell this man puts his heart and soul into his food and his restaurant and takes great pride in his work. Of course, with this approach to cooking, the food was absolutely incredible. Freshly prepared warm whole wheat bread was brought to the table. Everything on the menu looked great so we ordered a little of everything. We both ordered one of the two soup options. I don't remember what it was called, but it had lots of lentils and vegetables. It was very nice, perfect portion, perfect temperature, and flavorful. We both ordered beef kebab and received a side salad with the order. All of the vegetables in the salad were very crisp and fresh. The dressing was homemade. For a complimentary salad that came with our meal, this went above and beyond. Now let me rave about the beef kebabs! They were really wonderful as well! The meat was tender, juicy, not tough or dry as in some Mediterranean restaurants. It was a little spicy, which I enjoyed. It came with rice, grilled vegetables, and salsa. It was a perfect portion with beautiful presentation and excellent flavors. Also, we really loved the hot green tea! We both shared one pot. It was very high quality green tea brewed to perfection with a touch of honey. Truly I have never tasted such a delicious green tea. I will definitely be returning to Momo's Kebab. I really want to try one of their specials on Thursday, Friday, or Saturday night.","useful":2,"user_id":"n6sxZHu9wmUVrJI6TDRiaA"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-08-19","funny":0,"review_id":"AKJmMpu1a6DykW26oYTveQ","stars":5,"text":"Awesome gem in Cleveland Heights! I ordered the beef kebab \"sandwich\" to-go. It is served with the meat\/veggies separate from the bread so you can decide how you want to enjoy it, which I love. Everything was cooked really well and the portion size was great for the affordable price ($7). You even get a hearty side salad in addition.\n\nThe staff was so incredibly friendly and ensured you had a great experience. Will definitely be back for more!","useful":0,"user_id":"frrW7_J4Pzfw6d92ZHJSAg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-05-10","funny":0,"review_id":"Q7BBeJHTjPkXYLm2i5d3FQ","stars":5,"text":"The east side needs more places like this, which is why I'm writing this review, hoping that people go and support this guy. The food is delicious, fresh, and well-priced. You can really tell that everything is made from scratch since some of the flavors are really nuanced and unlike those found elsewhere (especially the sauces). Go there.","useful":1,"user_id":"KefA0WXMTjEpgpeivvY6WA"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-06-18","funny":0,"review_id":"Nyh6ccpmYcim3JhIGZGKmw","stars":4,"text":"I wanted to try some different regional cuisines, and while looking up restaurants in Cleveland Heights I happened upon a restaurant that was advertised as Moroccan cuisine. \n\nThis was my first time having Moroccan cuisine, and I was thoroughly impressed. I got the beef tagine, and there isn't anything quite like beef and vegetables that have been stewed for a very long period of time. The beef was juicy and tender, and because it was stewed, the meat was very easy to cut and quite tasty. The carrots and potatoes were also super soft.\n\nI also got the lamb platter, which likewise came with an assortment of vegetables as well as some rice. The lamb was pretty good too, though not as amazing as the tagine.\n\nBoth entrees came with salad and bread. The salad was fairly standard, but the bread was incredibly tasty and well seasoned.","useful":0,"user_id":"Z27fERSsub99cZNbcJHBDg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-07-09","funny":0,"review_id":"15fb2eEVlP4Sr7sLkwrTSg","stars":5,"text":"A restaurant that you leave feeling that right amount of fullness, not feeling polluted or still hungry! The chef individually serves each table and prepares everything on the spot! We ordered the tabouleh salad and chicken and beef kabobs. The perfect spice level that was quenched with a definite must, the warm green tea with fresh mint! Will be returning soon!","useful":0,"user_id":"xbJxVZve6bMkct2pqft40g"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-03-01","funny":0,"review_id":"w2zWnBacU6dGjYsN0WNprg","stars":5,"text":"The food is fresh and amazing. We ordered the grilled chicken platter and tea and everything was extremely good. You can tell the food is authentic and the owner is very friendly. This is our third visit in two weeks and we will definitely be back.","useful":2,"user_id":"88z-SqRXlD8T9iYM6bAISw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-06-11","funny":0,"review_id":"Ug5OOJziLewbjHp1S_dfUQ","stars":5,"text":"I have seen MoMo's Kebab for some months and wanted to try it. My son and I dined there tonight and had a great meal. The Moroccan tea was delish and the salads with freshly baked whole wheat bread rolls were very fresh and tasty. My son had the beef kebab and I had the kefta kebab and they were both lovely; the hot sauce was good - spicy without being overwhelming. Both meals came with rice and grilled vegis, and the whole meal was under $25. The chief\/owner was very personable and interesting to talk with. I hope his business continues to expand as he explained to us. It was a treat of an evening out and I definitely will be back.","useful":1,"user_id":"YZw7puXgpRt4FJuYZ6N22w"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-08-22","funny":0,"review_id":"GYwpOBp06pzFy4uAUGMglg","stars":5,"text":"Well, it just doesn't get much better than this. Our first (and certainly not last) Momo's experience hit all of our most prized dining-out criteria:\n\n- Simple, fresh, and healthfully prepared foods\n- An authentic ethnic food experience\n- Extraordinary value for the price point\n- Warm, welcoming service\n\nThis place does just a few things and does them WELL. Homemade flatbreads with simple ingredients, fresh, lean marinated meats. Simple grilled veggies. Hot, strong, sweet mint tea. Homemade cookies. That's the bulk of the menu and it's all delightful. Bonus: you could easily get out of Momo's, satisfied, for about $10.00 per person. Perfect!","useful":1,"user_id":"NhKd1Exzt6SXjdR0PY62Aw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-04-29","funny":0,"review_id":"gZXSG_k281mwe-xrDiqGeg","stars":5,"text":"This place is a gem! Really enjoyed my platter with a little of everything on it. Chef MoMo is quite the host! Came out, explained everything on the menu, was amazingly personable and make the experience really fun. Not to mention, the food was amazing. Will be back!","useful":0,"user_id":"AAad7NBwWz6cctsYGJ5JNA"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-10-24","funny":0,"review_id":"Cf8Sew-_5FaqCPk-7FbGZQ","stars":2,"text":"We had lunch here and were the first customer of the day. The gentleman working there was very friendly but the food was really oily and bland. I had the lamb and my wife had the grilled vegetable platter. Both were under seasoned and too greasy. The tabouli was really good tho and the fresh bread was good, although very crunchy. We'll prob try it again but were a bit disappointed with our visit.","useful":0,"user_id":"vZMNPjs8K6ez-OLrFsjisw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-03-06","funny":1,"review_id":"6QjXQownAbq94b9BMU22mA","stars":5,"text":"I love a personal touch, and on top of great food and service, this place has just become a favorite of mine. \n\nThe menu is small, but amazingly well done. The cuisine is Moroccan, and for us, was served by the chef himself in a friendly, welcoming way. \n\nThe kebab is amazing; flavorful, simple and tasty, with wonderful rice and grilled vegetables that will make mouths WATER. (I especially loved the eggplant, and my wife, who is not always a veggie fan, loved every bit.) All of the platter meals are served with hot half-loaves of a tasty grain bread, and side salads festooned with olives and a wonderful lemon vinaigrette. \n\nThe drink menu is mostly only water, but if you get a chance, here's a tip; order the green mint tea. Served in a long-pour Moroccan style,(by the owner himself.) It's tasty, soothing, sweet and minty. My wife and I agreed next time, we get TWO pots! \n\nTo top it off, we got some of the house cookies, which are classic stuff; nutty, tasty and really a great way to finish off the meal. \n\nParking here is a bit sparse, but there's a great parking garage behind the building (city run) that's very safe and not too expensive at all. \n\nSo, if you're looking for a treat and want something authentic and well done, try this little place on Lee Road. To sum up, I can only say this; when it comes to Kebab, MAKE MINE MOMO'S !!","useful":2,"user_id":"3lil3eH4skNVzI0y3vM72w"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-01-19","funny":0,"review_id":"88i77l0KT1mOvLBly39-dw","stars":5,"text":"Food was amazing! The mint tea was good, but drink fast because it gets bitter. The lamb was phenomenal. The bread was fresh. The salad was good. Overall a 10\/10 meal. Owner was super nice too!","useful":0,"user_id":"O3p2-rKwo2RfQKC2s3ojlw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-05-02","funny":0,"review_id":"2ErakdH66bSDauCEYkLxZg","stars":5,"text":"Great food! The chef clearly  takes pride in the food that he makes.The menu has only has a few items on it. However, the food is fresh and delicious! Give this place a try and enjoy a nice chat with the chef while you are at it about Morocco ( the place where he is from).","useful":1,"user_id":"Yy3Vh9fPFLwwv8HdGVFj7A"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2017-07-16","funny":0,"review_id":"rsCZsL8ewnpuXNhqmB-Czw","stars":5,"text":"We came on a Saturday night and waited a little bit before seated. We ordered the harira, tabouleh, lamb platter, and lamb tagging special. Everything was delicious, tasted homemade, fresh, and perfectly seasoned. We were started on a complementary salad - what a pleasant surprise! Perfectly seasoned with good quality olive oil and lemon juice, I love the peppery bite of the radish and tanginess of feta cheese. The tabouleh tasted super fresh and really opened up our appetite. The harira, though also delicious, was probably the least outstanding dish of the night. \n\nNow onto the main courses - the lamb platter came with 2 lamb loin chops, grilled veggies, and saffron rice. The lamb was grilled to a perfect medium rare, tender and flavorful with fresh herbs. The saffron rice was fluffy and cooked perfected. The grilled veggies was great - I especially love the undertone of good olive oil in them. It came with a dollop of harissa - it had a nice kick and complemented the lamb perfectly. \n\nThe lamb tagine was also outstanding. The meat was tender and the potatoes and carrots soaked up all the delicious meat flavor. I used the bread to dip into and mop up the sauce. The only critique I have was the portion of the tagine dish was quite small. \n\nI would definitely come back and can't wait to try all their dishes!","useful":0,"user_id":"XvEOKQ0DcM1CkRPYA_3GJg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-07-17","funny":0,"review_id":"Op0sVp1JdxFFK7mZvJBj_Q","stars":4,"text":"The ambience,host and simple menu were great. I would give it 5 star if the beef kebabs were not dry. The house salad and mint tea were great!","useful":0,"user_id":"pkq44EgxHypB9Rz3eJEZDg"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2015-03-18","funny":0,"review_id":"aDClo2XngjWlijg5Zp0eWQ","stars":4,"text":"we stopped for dinner tonight. the decor is clean and colorful, dim enough to feel romantic, but bright enough to entertain a child. menu is brief and simple. had the harira soup, chicken kebab, beef kebab and tea service for 3. sitting in the inviting window seats with low tables gives a great survey of the happenings on Lee Road, but hard to eat the soup! perfect for tea and cookies though.\n\nhighlights: the green tea with mint is amazing. the service borders on ritual; a lovely way to sit and visit. the kebabs were both very good, and the accompanying salads were fresh, crisp and light, lemony and the perfect portion. while the service is not slow, you will need to embrace the experience of leisurely dining...each dish is made to order, and the freshness is worth it. we did find the harira soup and rice under seasoned, but snuck a little salt and all was well. our daughter actually loved the soup, with a nice chunk of bread to dip.\n\nthe chef was very kind and attentive, and we'll be back to try some of the specials, featured from Thursday - Saturday.","useful":2,"user_id":"C2LcYA2P_o41h7ILngVVZw"}
{"business_id":"0jHZk9RrKh0uRhTRW1XIqQ","cool":0,"date":"2016-08-21","funny":0,"review_id":"6ebPFegyCN3chi3s-uVBZw","stars":2,"text":"Everything was just ok - we didn't try the tagine - which is the house specialty and probably the best dish. The vegan couscous had a great spice to it. The tabouli is very fresh and tastes strongly of lemon. The green salads come with a lot of dressing. The chicken kebab was dry. All of it comes with a dense round wheat bread. If we give the place another try we will wait until fall. The air conditioning is very weak so it was hotter inside than outside (on a 90 degree day). Ask for ice in your water on the hot days!","useful":0,"user_id":"W4fQ5Eay71kAUW0cTMjehw"}